{"timestamp": "2019-02-22T01:11:17.795522+00:00", "links": [{"title": "Seeking the Productive Life: Some Details of My Personal Infrastructure—Stephen Wolfram Blog", "description": "", "url": "https://blog.stephenwolfram.com/2019/02/seeking-the-productive-life-some-details-of-my-personal-infrastructure/", "hostname": "blog.stephenwolfram.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220889"}, {"title": "when was wolfram nks released - Google Search", "description": "stephen wolfram net worth", "url": "https://www.google.com/search?q=when+was+wolfram+nks+released&oq=when+was+wolfram+nks+released", "hostname": "www.google.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19222052"}, {"title": "Live CEOing Ep 222: Financial Data Feeds in Wolfram Language", "description": "Watch Stephen Wolfram and teams of developers in a live, working, language design meeting. This episode is about Financial Data in the Wolfram Language.", "url": "https://www.youtube.com/watch?v=HGjvFyRk_4I&feature=youtu.be&list=PLxn-kpJHbPx14mHrB5BlhImVOWo5Geg6f&t=271", "hostname": "www.youtube.com", "category": "video", "comment_url": "https://news.ycombinator.com/item?id=19221549"}, {"title": "targetblank", "description": null, "url": "https://targetblank.org", "hostname": "targetblank.org", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19222161"}, {"title": "Uses This: Stephen Wolfram", "description": "Scientist, developer, mathematician", "url": "https://usesthis.com/interviews/stephen.wolfram/", "hostname": "usesthis.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221876"}, {"title": "Wolfram Mathematica - Wikipedia", "description": "Wolfram Mathematica (usually termed Mathematica) is a modern technical computing system spanning most areas of technical computing — including neural networks, machine learning, image processing, geometry, data science, visualizations, and others. The system is used in many technical, scientific, engineering, mathematical, and computing fields. It was conceived by Stephen Wolfram and is developed by Wolfram Research of Champaign, Illinois.[7][8] The Wolfram Language is the programming language used in Mathematica.[9]\n", "url": "https://en.wikipedia.org/wiki/Wolfram_Mathematica", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19221738"}, {"title": "Stephen Wolfram, A New Kind of Science", "description": "Attention conservation notice: Once, I was one of the authors of a\npaper on cellular automata.\nLawyers for Wolfram Research Inc. threatened to sue me, my co-authors and our\nemployer, because one of our citations referred to a certain mathematical\nproof, and they claimed the existence of this proof was a trade secret\nof Wolfram Research.  I am sorry to say that our employer knuckled under, and\nso did we, and we replaced that version of the paper with another, without the\noffending citation.  I think my judgments on Wolfram and his works are\naccurate, but they're not disinterested.\n\nWith that out of the way: it is my considered, professional opinion that\nA New Kind of Science shows that Wolfram has become a crank in the\nclassic mold, which is a shame, since he's a really bright man, and once upon a\ntime did some good math, even if he has always been arrogant.\n\nAs is well-known (if only from his own publicity), Wolfram was a child\nprodigy in mathematics, who got his Ph.D. in theoretical physics at a tender\nage, and then, in the early and mid-1980s, was part of a wave of renewed\ninterest in the subject\nof cellular automata.  The\nconstant reader of these reviews will recall that these are mathematical\nsystems which are supposed to be toy models of physics.  Space consists of\ndiscrete cells arranged in a regular lattice (like a chess-board, or a\nhoneycomb), time advances in discrete ticks.  At each time, each cell is in one\nof a finite number of states, which it changes according to a preset rule,\nafter examining the states of its neighbors and its own state.  A physicist\nwould call a CA a fully-discretized classical field theory; a computer\nscientist would say each cell is a finite-state transducer, and the whole\nsystem a parallel, distributed model of computation.  They were introduced by\nthe great mathematician John von Neumann in the 1950s to settle the question of\nwhether a machine could reproduce itself (answer: yes), and have since found a\nproductive niche in modeling fluid mechanics, pattern formation, and many kinds\nof self-organizing system.\n\nAfter the foundational work of von Neumann and co., there was a long fallow\nperiod in the study of CAs, when publications slowed to a trickle, and people\nwere more likely to think of themselves as studying the statistical mechanics\nof spin systems, or the ergodic properties of interacting particle\nsystems, than cellular automata as such.  The major exception was a popular CA\ninvented by John Conway, the Game of Life, or just Life, which spawned a\ndedicated following, trying to fathom how such a ridiculously simple set of\nrules could produce such monstrously complicated results.  In the late 1970s,\nmathematicians and physicists began to become increasingly interested in CAs as\nsuch, largely owing to the advent of (comparatively) cheap and powerful desktop\ncomputers, which let people simulate and visualize CAs.  There was a school of\nthought — obscure, but surprisingly widely known — which, following the\nphysicist Ed Fredkin, thought that the universe as\na whole might in some sense be a CA.  Many people participated in this\nrevival, in many places — prominent names include, alphabetically,\nCrutchfield, Durrett, Farmer, Frisch, Goles, Grassberger, Liggett, Margolus,\nPackard, Toffoli, Vichniac, etc.\n\nWolfram's first paper on CAs, published in 1983, was titled\n\"The\nStatistical Mechanics of Cellular Automata\".  It focused its attention on\nparticular simple — he said \"elementary\" — CAs: one spatial dimension, two\npossible states for each cell, and a neighborhood consisting of the sites to\nthe immediate right and left of a given cell.  There are 8 possible\nconfigurations for such neighborhoods, and so 256 possible elementary CA rules;\nin the paper, Wolfram introduced a useful scheme for referring to those rules,\nand others, by number, so that we speak of rule 18, rule 22, rule 90, rule 110\n(of which much more below), etc.  Beyond that, the paper largely consisted of\ncalculating the entropy of configurations generated by different rules, and\nsaying that, while the rules were simple, the patterns they could generate were\ncomplicated and intriguing.  Well, and so they were; and so said many other\npeople at the first major modern conference on CAs, organized by Farmer,\nToffoli and Wolfram at Los Alamos in 1983.\n\nWolfram went on to publish a bunch more papers on CAs over the next few\nyears: probably the most noteworthy are\n\"Computation\nTheory of Cellular Automata\" (1984), where he used a familiar device of\nelementary computer science (regular languages and their equivalent finite\nautomata) to characterize the set of configurations it is possible for a CA to\nproduce, and\n\"Universality\nand Complexity in Cellular Automata\", where he proposed a four-fold\nclassification of CAs based on their long-run behavior.  Class I decay to a\nfixed, static configuration; class II to periodic oscillation; class III to\nseething, pseudo-random, chaotic gurp; class IV were supposed to have\ncomplicated ordered structures interacting in odd ways, and never really settle\ndown.  This scheme was popular for a while, but no one (including Wolfram) was\never able to make it any more precise, and it's proved basically worthless for\nunderstanding what CAs do; it was a Nice Try.  (For more on the problems with\nthis scheme, see Lawrence Gray's\nreview of this book\n[PDF].)\n\nIn the mid-1980s, Wolfram had a position at the University of\nIllinois-Urbana's Beckman Institute for complex systems.  While there, he and\ncollaborators developed the program Mathematica, a system for doing\nmathematics, particularly algebraic transformations and finding exact-form\nsolutions, similar to a number of other products (Maple, Matlab, Macsyma,\netc.), which began to appear around the same time.  Mathematica was good at\nfinding exact solutions, and also pretty good at graphics.  Wolfram quit\nIllinois, took the program private, and entered into complicated lawsuits with\nboth his former employee and his co-authors (all since settled).\n\nWolfram has since retreated from normal scientific life, in to, on the one\nhand, tending the Mathematica empire, and, on the other, his peculiar\nscientific vision and method.  The vision is of the universe as, if not exactly\na CA, then a simple discrete program of some sort.  The method has involved an\nenormous number of man-hours on the part of subordinates who are, as it were,\nenserfed to him, scanning the behavior of likely-looking CAs and signing over\nthe rights to their discoveries to Wolfram; their efforts are supplemented by\nfrequent lawsuits and threats of lawsuits against those whom Wolfram feels have\ninfringed on his turf.  (In 1986, for instance,\nWolfram filed\na patent on the idea of using CAs as discrete approximations to partial\ndifferential equations, long after the idea was commonplace in the field; it\nwas, for instance, expounded at length\nin two papers in the 1983\nconference proceedings he helped edit.\nHis 1986\npaper on the subject is, however, a very important contribution to the\nfield, now known as lattice-gas\nhydrodynamics.)\n\nWhat, then, is the revelation Wolfram has been vouchsafed?  What is\nthis new kind of science?  Briefly stated, it is the idea that we should give\nup trying on complicated, continuous models, using normal calculus or\nprobability theory or the like, which try to represent the mechanisms by which\ninteresting phenomena are produced, or at least to accurately reproduce the\ndetails of such phenomena.  Instead we should look for simple, discrete models,\nlike CAs (\"simple programs\", as he calls them) which qualitatively reproduce\ncertain striking features of those phenomena.  In addition to this\nmethodological advice, there is the belief that the universe must in some\nsense be such a simple program — as he has notoriously said,\n\"four lines of Mathematica\".  Most of the bulk of this monstrously bloated book\nis dedicated to examples of this approach, i.e., to CA rules which produce\npatterns looking like the growths of corals or trees, or explanations of how\nsimple CAs can be used to produce reasonably high-quality pseudo-random\nnumbers, or the like.\n\nAs the saying goes, there is much here that is new and true, but what is\ntrue is not new, and what is new is not true; and some of it is even old and\nfalse, or at least utterly unsupported.  Let's start with the true things that\naren't new.\n\nWolfram refers incessantly to his \"discovery\" that simple rules can\nproduce complex results.  Now, the word \"discovery\" here is legitimate, but\nonly in a special sense.  When I took pre-calculus in high school, I came up\nwith a method for solving systems of linear equations, independent of my\ntextbook and my teacher: I discovered it.  My teacher, more patient than I\nwould be with adolescent arrogance, gently informed me that it was a standard\ntechnique, in any book on linear algebra, called \"reduction to Jordan normal\nform\", after the man who discovered it in the 1800s.  Wolfram discovered simple\nrules producing complexity in just the same way that I discovered Jordan normal\nform.\n\nI am not going to dwell on the way that finding simple laws to account for\nmultitudes of complex phenomena has been the highest aim of the exact sciences\nsince at least Galileo and Newton.  But this idea has been a driving force in\nmathematical logic and computer science since Alan Turing, A. N. Kolmogorov and\nEmil Post (he of the \"tag\" system, of which more\nlater).  Herbert Simon eloquently\nexplained the importance of the idea for the study of adaptation, psychology\nand society in his famous 1969 book, The Sciences of the\nArtificial. In 1973, the physicist-turned-ecologist Robert May published\na well-known paper in Nature on, as the title had it, the\ncomplicated dynamics of a simple equation.  It was an idea that was very much\nin the air, everywhere, in the early 1980s when Wolfram came on the scene\n— to pick two books at random from 1984, for instance, neither especially\nhard reading, there was Valentino Braitenberg's wonderful venture in\nneuroscience and AI, Vehicles,\nand William Poundstone's\npopular book on cellular automata and \"cosmic complexity,\" The Recursive\nUniverse (sadly out of print).  I could multiply instances ad\nnauseam, if I haven't already.\n\nIn an atrocious chapter on processes of learning and perception, Wolfram\nsays that Mathematica, because it works by applying transformation rules to\nexpressions that fit certain patterns, has a unique affinity for the way the\nhuman mind works, an affinity that isn't captured by any theory in cognitive\nscience or AI.  But this is just a rough description of the production-rules\napproach to modeling cognition, including memory, which was pioneered in the\nearly 1950s by Herbert\nSimon and Allen\nNewell.  In fact, their work helped drive the development of the LISP\nprogramming language, from which Mathematica descends.  The book is full to\nbursting with this kind of thing, in every area of science it touches on that\nI'm at all familiar with. I could go over Wolfram's discussion of biological\npattern formation, gravity, etc., etc., and give plenty of references to people\nwho've had these ideas earlier.  They have also had them better, in\nthat they have been serious enough to work out their consequences, grasp their\nstrengths and weaknesses, and refine or in some cases abandon them.  That is,\nthey have done science, where Wolfram has merely thought.\n\nBy way of making the transition to the new, untrue stuff, let's consider\nwhat we mean by \"simple\" and \"complex\".  This is a highly involved subject, as\nthere are many different proposed measures of complexity.\n(Badii and\nPoliti's Complexity remains the best survey.)  The classical\nnotion is that of algorithmic complexity, often called Kolmogorov complexity\nafter one of its three simultaneous discoverers.  (The other two\nwere Ray Solomonoff\nand Gregory\nChaitin.)  The algorithmic complexity of an object, say a string of digits,\nis the length of the shortest computer program which will produce that object\nand then halt.  There is always a program which can do this; if the object\nis x, the program \"print(x)\" will do, and the length\nof this program is the same as the length of x, plus a trivial\nconstant.  Simple objects only need short programs; complex objects need\nprograms approximately as long as the original object, and are called\n\"incompressible\".  Kolmogorov's goal, in setting up algorithmic complexity, was\nto give a non-probabilistic definition of randomness.  Probability theory tells\nus much about what random sequences of digits must be like; in a uniform random\nsequence of binary digits, for instance, there must be as many instances of\n\"01\" as \"00\", to give a trivial example.  Speaking roughly, Kolmogorov showed\nin the 1960s that infinitely long incompressible sequences have all the\nproperties of random sequences.\n\nAround 1970, Kolmogorov's disciple, Per Martin-Löf, extended this, in a\nvery interesting direction.  If we consider a finite random sequence,\nthere is some probability that it won't exactly satisfy any given property of\nthe ideal infinite random sequence — it might contain \"01\" slightly more\noften than \"00\", say.  This leads to the idea of testing for\nrandomness, and accepting as random only objects which are sufficiently close\nto the ideal, i.e., which do not deviate from the ideal in ways which would be\nvery improbable.  Martin-Löf showed, again roughly speaking, that complex\nobjects will pass many high-reliability tests for randomness,\nand conversely objects which pass randomness\ntests must have high algorithmic complexity.\n\nWolfram (naturally) ignores all existing measures of physical complexity,\nand (quite astonishingly) avoids giving any quantitative measure of complexity\nof his own.  Instead, he just says he'll count as complex things which are (I)\nvisually interesting and (II) pass standard tests for randomness, as used in\ncomputer programming and cryptography.  Now, if something satisfies (I), that\nis as much a fact about Stephen Wolfram, or, more generously, about the visual\ncortex of the East African Plains Ape, as it is a fact about the object.\nPassing (II) just means, by virtue of Martin-Löf's results, that the\nalgorithmic complexity is not too low.  Significantly, this part of\nMartin-Löf's work is never mentioned by Wolfram.\n\nAs for the new, untrue stuff, there's so much I hardly know where to start.\nBut he and I were both trained as physicists, so I'll pick on his account of\nquantum mechanics, relativity and gravitation.  I said earlier that CAs are the\ndiscrete counterparts of classical field theories.  If the universe worked by\nclassical physics, then one could argue that a CA approach to physics might\nwork just as well as the continuous-field approach, provided you made the scale\nof the cells small enough, and the number of states per cell large enough.\n(Many people have so argued.)  After all, movies demonstrate that apparent\ncontinuity is no argument for real continuity, and it's hard to see how any\ntest could do more than put an upper bound on the scale of the cells. But we\nknow classical physics isn't right; the universe is (to a much better\napproximation) quantum and relativistic.  It's comparatively easy to define\nquantum cellular automata; this is in effect what the sub-industry of lattice\nquantum field theory does.  What's harder is to get relativity right.  Ordinary\nCAs are well-adapted to classical space-time, but not to the space-time of\neither special or general relativity.  (They can have Galilean invariance, but\nnot Lorentzian.)  With some ingenuity, you can get a discretized version of\nspecial relativity to work in CAs (this was shown by Mark Smith in a 1994\ndissertation at MIT).  No one has figured out how to make general relativity,\nand with it gravity, work in a CA.  Wolfram is aware of this, and tries to\nexplain both quantum mechanics and gravity through deterministic dynamics on a\nkind of recursive network (not a CA).  This is reminiscent of much more\nadvanced work on \"spin foams\" in quantum gravity, which however\ndoes not try to explain away quantum effects, and is susceptible to\nactual calculations.  (This approach is also known\nas \"loop quantum gravity\".)\nIn any event, not long after this book was\npublished, Scott Aaronson\nproved that Wolfram's scheme must either conflict with special relativity\n(by breaking Lorentz invariance), or conflict with quantum mechanics (by\nobeying Bell's inequalities), or indeed both.  It is a non-starter.\n\nAnother egregious weakness is biology.  Wolfram displays absolutely no\nunderstanding of evolution, or what would be necessary to explain the\nadaptation of organisms to their environments.  This is related to his peculiar\nviews on methodology.  If you want to get a rough grasp of how the leopard\nmight get its spots, then building a CA model (or something similar) can be\nvery illuminating.  It will not tell you whether that's actually how\nit works.  This is an important example, because there is a classic theory of\nbiological pattern formation, or morphogenesis, first formulated by Turing in\nthe 1950s, which lends itself very easily to modeling in CAs, and with a little\nfine-tuning produces things which look like animal coats, butterfly wings,\netc., etc.  The problem is that there is absolutely no reason to think that's\nhow those patterns actually form; no one has identified even a single pair of\nTuring morphogens, despite decades of searching. [See \"Update, 4 March 2012\"\nbelow.]  Indeed, the more the biologists unravel the actual mechanisms of\nmorphogenesis, the more\ncomplicated and inelegant\n(but reliable) it looks.  If, however, you think you have\nexplained why leopards are spotted after coming up with a toy model that\nproduces spots, it will not occur to you to ask why leopards have spots but\npolar bears do not, which is to say that you will simply be blind to the whole\nproblem of biological adaptation.\n\nLeaving evolution and adaptation to one side, saving the qualitative\nphenomena doesn't mean that you have the right mechanism,\neven qualitatively. If, in addition, you want quantitative accuracy\n— either for engineering purposes, or to compare hypotheses which all\nproduce the same qualitative results — you obviously can't just get by\nwith Wolfram's \"new kind of science\" — or, as we say in the trade, with\ntoy models.  To be fair, toy models sometimes can be quantitatively\naccurate, but only in peculiar\ncircumstances which do not generally obtain, and certainly don't extend to\nWolfram's toys.  We must not, however, expect this to deter a man capable of\nsummarizing his methodology in the brilliant\naphorism, \"I\nam my own reality check.\"\nThere is one new result in this book which is genuinely impressive, though\nnot so impressive as Wolfram makes it out to be.  This is a proof that one of\nthe elementary CAs, Rule 110, can support universal computation.  To explain\nthis needs a slight detour through the foundations of computer science.\n\nTheoretical computer science studies the properties of abstract, formal\nsystems which do computations.  A common type of problem goes like this: given\nan abstract machine, an automaton, of a certain sort, what kinds of\ncomputations can it do?  For instance, if you have a machine with finite\nmemory, can it divide sequences of left and right parentheses into sequences\nwith an even number of right parentheses from those with an odd number of them?\n(Answer: yes.)  Could it recognize balanced sequences, in which every left\nparenthesis is a later matched by a corresponding right parenthesis, and vice\nversa?  (Answer: No; you need an unbounded memory.  Proof is left as an\nexercise.)  While these examples are trivial, more complicated versions become\nserious questions in linguistics, optimization, cryptography, data-bases,\ncompilers, etc.\n\nIn 1936, Turing proposed a class of automata which have since come to be\ncalled Turing machines, and showed that every function which can be defined\nrecursively can be computed by some Turing machine.  More remarkably yet, he\nshowed that there were universal Turing machines — ones which could be\nprogrammed to emulate any other Turing machine.  Now, there are other models of\ncomputation, other basic classes of automata, but so far it has turned out that\neverything they can compute can also be computed by Turing machines.  We can\nshow that some of these, in turn, can compute anything a Turing machine can\ncompute.  This has led to the Church-Turing Thesis, that any function which can\nbe specified effectively can be computed by a Turing machine; a system which\ncan emulate a universal Turing machine is thus a universal computer.\n\nThe easiest way to show that something is a universal computer is to show\nthat it can emulate something you already know is a universal computer, like a\nTuring machine.  Now, it's been known since the work of Emil Post in the 1930s\nthat something called a Post tag system\n(see here\nor here for more or less\nmathematical explanations) is Turing-equivalent.  A New Kind of\nScience describes a new formal system, called a cyclic tag system\n(Wolfram drops \"Post\"), which is equivalent to a Post tag system, and so to a\nuniversal Turing machine.  Finally, there is a sketch of how propagating\nstructures (\"gliders\") in Rule 110 can be used to implement a cyclic tag\nsystem, assuming you had an infinite lattice to play with.\n\nThis is a genuinely new result.  Rule 110 is the simplest CA (in terms of\nthe number of states and the rule radius) which is known to support universal\ncomputation.  (Indeed, in his 1985 book on cellular automata, Wolfram declared\nthat universal computation in an elementary CA was obviously impossible.)\nHowever, lots of things are capable of universal computation — there's\nless interest in this kind of result than there was in, say, 1970.  In 1990,\nfor instance, Cristopher Moore\ndevised a kind of\nidealized pin-ball machine which is capable of universal computation.  This\nresult, like the one about rule 110, is neat for people who care about\ndynamical models of universal computation — on the order of a thousand\nscientists and mathematicians world wide.  What Wolfram wants to claim is that,\nsince one universal computer is equivalent to another, by studying the behavior\nof one we learn things which are true of all others (true), therefore Rule 110\nis as complex as anything in the universe, and all intelligent life, including,\nperhaps, the gods must have much in common.  This, to put it mildly, does not\nfollow.  Wolfram even goes on to refute post-modernism on this basis; I won't\ntouch that except to say that I'd have paid a lot to see Wolfram and Jacques\nDerrida go one-on-one.\n\nThe real problem with this result, however, is that it is not Wolfram's.  He\ndidn't invent cyclic tag systems, and he didn't come up with the incredibly\nintricate construction needed to implement them in Rule 110.  This was done\nrather by one Matthew Cook, while working in Wolfram's employ under a contract\nwith some truly remarkable provisions about intellectual property.  In short,\nWolfram got to control not only when and how the result was made public, but to\nclaim it for himself.  In fact, his position was that the existence of\nthe result was a trade secret.  Cook, after a messy falling-out with Wolfram,\nmade the result, and the proof, public at a 1998 conference on CAs.  (I\nattended, and was lucky enough to read the paper where Cook goes through the\nconstruction, supplying the details missing from A New Kind of\nScience.)  Wolfram, for his part, responded by suing or threatening to\nsue Cook (now a penniless graduate student in neuroscience), the conference\norganizers, the publishers of the proceedings, etc.  (The threat of legal\naction from Wolfram that I mentioned at the beginning of this review arose\nbecause we cited Cook as the person responsible for this result.)\n\nOf course, lots of professors add their names to their students' papers, and\nmany lab-chiefs owe their enviable publication records to the fact that they\nautomatically add their names to the end of every manuscript prepared under\ntheir command.  If Wolfram did that, he would merely be perpetuating one of the\nmore common abuses of the current scientific community.  But to deny Cook any\nauthorship, and to threaten people with lawsuits to keep things quiet, is\nindeed very low.  Happily, the suit between Wolfram and Cook has finally been\nresolved, and\nCook's paper\nhas been published, under his own name, in Wolfram's journal Complex\nSystems.\n\nSo much for substance.  Let me turn to the style, which is that of monster\nraving egomania, beginning with the acknowledgments.  Conventionally, this is\nyour chance to be modest, to give credit to your sources, friends, and\ninevitably long-suffering nearest and dearest.  Wolfram uses it, in five point\ntype, to thank his drudges (including Matthew Cook for \"technical content and\nproofs\"), and thank people he's talked to, not for giving him ideas and\ncorrections, but essentially for giving him the opportunity to come up with his\nown ideas, owing nothing to them.  (Bringing to mind Monty Python: \"Your\nMajesty is like a stream of bat's piss: you shine out like a shaft of gold,\nwhen all around is dark.\")  This extends to thanking his mother for giving him\na classical British education.  (Wolfram's ideas of gentlemanly conduct seem\nsomewhat at variance with those traditionally associated with Eton.)  The\ncustomary self-effacement of scientific prose sometimes leads to boring\nwriting, but it is immensely preferable to incessant self-aggrandizement.  This\nextends even to grammar: wherever possible, Wolfram talks about other people's\nefforts in the passive voice (\"the notion of undecidability was developed in the\n1930s\", not \"Gödel and Turing developed the notion of undecidability\").\nWolfram actually has the gall to say that he's deliberately writing like this,\nto help readers understand his difficult ideas!\n\nNormally, scientific work is full of references to previous works, if only\nto say things like \"the outmoded theory of Jones [1], unable to accommodate\nstubborn experimental facts [2--25], has generally fallen out of favor\".  This\nis how you indicate what's new, what you're relying on, how you let readers\nimmerse themselves in the web of ideas that is an particular field of research.\nWolfram has deliberately omitted references.  Now, this is sometimes done:\nDarwin did it in The Origin of Species, for instance, to try to\nget it to press quickly.  But Wolfram has written 1100 pages over about a\ndecade; what would it have hurt to have included citations?  In his end-notes,\nwhere he purports to talk about what people have done, he is misleading, or\nwrong, or both.  (An indefinite number of examples can be provided upon\nrequest.)  To acknowledge that he had predecessors who were not universally\nblinkered fools would, however, conflict with the persona he tries to project\nto others, and perhaps to himself.\n\nLet me try to sum up.  On the one hand, we have a large number of true but\ncommonplace ideas, especially about how simple rules can lead to complex\noutcomes, and about the virtues of toy models.  On the other hand, we have a\nlarge mass of dubious speculations (many of them also unoriginal).  We have,\nfinally, a single new result of mathematical importance, which is not actually\nthe author's.  Everything is presented as the inspired fruit of a lonely\ngenius, delivering startling insights in isolation from a blinkered and\nphilistine scientific community.  We have been this way before.\n\n[Some cranks] are brilliant and well-educated, often with an\nexcellent understanding of the branch of science in which they are speculating.\nTheir books can be highly deceptive imitations of the genuine article —\nwell-written and impressively learned....\n\t[C]ranks work in almost total isolation from their colleagues.  Not\nisolation in the geographical sense, but in the sense of having no fruitful\ncontacts with fellow researchers.... The modern pseudo-scientist... stands\nentirely outside the closely integrated channels through which new ideas are\nintroduced and evaluated.  He works in isolation.  He does not send his\nfindings to the recognized journals, or if he does, they are rejected for\nreasons which in the vast majority of cases are excellent.  In most cases the\ncrank is not well enough informed to write a paper with even a surface\nresemblance to a significant study.  As a consequence, he finds himself\nexcluded from the journals and societies, and almost universally ignored by\ncompetent workers in the field..... The eccentric is forced, therefore, to\ntread a lonely way.  He speaks before organizations he himself has founded,\ncontributes to journals he himself\nmay edit, and — until recently — publishes books only when he\nor his followers can raise sufficient funds to have them printed\nprivately.\nThus Martin Gardner's classic description of the crank scientist in the\nfirst chapter of\nhis Fads\nand Fallacies.  In lieu of superfluous comments, let us pass on to\nGardner's list of the \"five ways in which the sincere pseudo-scientist's\nparanoid tendencies are likely to be exhibited.\"\n\t\n\n He considers himself a genius.\n\t He regards his colleagues, without exception, as ignorant\nblockheads.  Everyone is out of step except himself....\n\t He believes himself unjustly persecuted and discriminated\nagainst....\n\t He has strong compulsions to focus his attacks on the greatest\nscientists and the best-established theories.  When Newton was the outstanding\nname in physics, eccentric works in that science were violently anti-Newton.\nToday, with Einstein the father-symbol of authority, a crank theory of physics\nis likely to attack Einstein in the name of Newton....\n\t He often has a tendency to write in a complex jargon, in many\ncases making use of terms and phrases he himself has coined....\n\t\n\n(1) is clearly true.  (2) is clearly true.  (3) is currently false,\nor at least not much on display in this book.  (4) is clearly true, though\nWolfram, befitting someone who was once a respectable physicist, aims to\nundermine Newton and Einstein, indeed the entire tradition of physical\nscience since Galileo.  (5) is true only to a very small degree (mercifully).\n\n\tWhen the crank's I.Q. is low, as in the case of the late\nWilber Glenn Voliva who thought the earth shaped like a pancake, he rarely\nachieves much of a following.  But if he is a brilliant thinker, he is capable\nof developing incredibly complex theories.  He will be able to defend them in\nbooks of vast erudition, with profound observations, and often liberal portions\nof sound science.  His rhetoric may be enormously persuasive.  All the parts of\nhis world usually fit together beautifully, like a jig-saw puzzle.\nThe natural result is a cult following.  Wolfram certainly has that, to\njudge from his sales, the attendance at his \"New Kind of Science\" conventions,\nand the reader reviews on Amazon.  (I presume they are not\nall a claque hired by Wolfram Media.)  This frankly is part of a\ndisturbing trend, pronounced within the field of complex systems.  In addition\nto Wolfram, I might mention the cult of personality around Ilya Prigogine, and Stuart Kauffman's book\nInvestigations, or even the way George Lakoff uses \"as cognitive\nscience shows\" to mean \"as I claimed in my earlier books\".\n\nThis brings me to the core of what I dislike about Wolfram's book.  It is\ngoing to set the field back by years.  On the one hand, scientists in other\nfields are going to think we're all crackpots like him.  On the other hand,\nwe're going to be deluged, again, with people who fall for this kind\nof nonsense.  I expect to have to waste a lot of time in the next few years\nde-programming students who'll have read A New Kind of Science\nbefore knowing any better.\n\nI don't object to speculation or radical proposals, even to radical,\ngrandiose speculative proposals; I just want there to be arguments to back them\nup, reasons to take them seriously.  I don't object to scientists displaying\npersonality in their work, or staking out positions in vigorous opposition to\nmuch of the opinion in their field, and engaging in heated debate; I do object\nto ignoring criticism and claiming credit for commonplaces, especially before\npopular audiences who won't pick up on it.  I don't even object to writing 1000\npage tomes vindicating one's own views and castigating doubters; I do object to\n1000 page exercises in badly-written intellectual masturbation.  Consider, by\nway of contrast, the late physicist E. T. Jaynes.  For four decades, he\ndefended original, radical views on the role of probability in physics, the\nnature of statistical mechanics and the place of inductive reasoning in\nscience.  These views were hotly contested on all sides; Jaynes met criticism\nwith astringent but engaged and intellectually honest replies.  At the time of\nhis death, he was working, as he had been for years, on\na mammoth book\nthat would have been the final, definitive statement of his views; even in the\nfragmentary state he left it, it was roughly as long as Wolfram's tome, and\ninfinitely more valuable.  I\nthink Jaynes's ideas\nwere dead wrong, but I wouldn't dream of calling him a crank.\n\nI suppose it's customary in writing reviews of this sort to try to say what\nhas driven Wolfram to write such a bad, self-destructive book.  But the truth\nis I couldn't care less.  He has talent, and once had some promise; he has\nsquandered them.  I am going to keep my copy of A New Kind of\nScience, sitting on the same shelf as Atlantis in\nWisconsin, The Cosmic Forces of Mu, Of\nGrammatology, and the people who think the golden ratio explains the\nuniverse.\n\n\nUpdate, 4 March 2012: There is now a fairly convincing\nexample of a pair of Turing morphogens in actual biology:\n\nAndrew D. Economou, Atsushi Ohazama, Thantrira Porntaveetus, Paul T Sharpe, Shigeru Kondo, M. Albert Basson, Amel Gritli-Linde, Martyn T. Cobourne and Jeremy B. A. Green, \"Periodic stripe formation by a Turing mechanism operating at growth zones in the mammalian palate\", Nature Genetics 44 (2012): 348--351\n\nThanks to a reader for letting me know about this.\n\n\n\n\n\nThanks are due to a number of friends, who might perhaps rather not be named\nin this connection.  Also: my present and past employers aren't responsible\nfor this in any way.\n\n\n1192 pp., many handsome black-and-white illustrations, index of names and\nsubjects\n\nCellular Automata /\nPhysics /\nSelf-Organization, Complexity, etc.\nIn print as a hardback, ISBN 1579550088, US$44.95.  Full text free online from the author\n\nMostly written July-August 2002; dusted off and made public 21 October 2005.\nURL for Cook's paper on rule 110 updated 20 March 2014.  Typo correction, 21 July 2014.<\n", "url": "http://bactra.org/reviews/wolfram/", "hostname": "bactra.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221844"}, {"title": "Your Personal Dashboard", "description": null, "url": "https://www.netvibes.com/en", "hostname": "www.netvibes.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19222149"}, {"title": "Amazon.com: Logitech M100 Corded Mouse – Wired USB Mouse for Computers and Laptops, for Right or Left Hand Use, Black: Electronics", "description": "Buy Logitech M100 Corded Mouse - Wired USB Mouse for Computers and Laptops, for Right or Left Hand Use, Black: Mice - Amazon.com ✓ FREE DELIVERY possible on eligible purchases", "url": "https://www.amazon.com/Logitech-Optical-Wired-Mouse-Black/dp/B003B4BBFK/*", "hostname": "www.amazon.com", "category": "amazon_item", "comment_url": "https://news.ycombinator.com/item?id=19222109"}, {"title": "You don’t understand \"ordinary people\"", "description": "Unhappy at being treated \"increasingly badly\" at the Institute for Advanced Study  in 1985 and as a result eager to begin an institute of hi...", "url": "http://www.lettersofnote.com/2010/06/you-dont-understand-ordinary-people.html", "hostname": "www.lettersofnote.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221918"}, {"title": "HN Search powered by Algolia", "description": "Hacker News Search, millions articles and comments at your fingertips.", "url": "https://hn.algolia.com", "hostname": "hn.algolia.com", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19221500"}, {"title": "Kurt Gödel is Laughing His Ass Off Right Now - Chris Hecker's Website", "description": null, "url": "http://chrishecker.com/Kurt_G%C3%B6del_is_Laughing_His_Ass_Off_Right_Now", "hostname": "chrishecker.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221263"}, {"title": "Global Leader in Risk Management Solutions | Pinkerton", "description": null, "url": "https://www.pinkerton.com", "hostname": "www.pinkerton.com", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19221994"}, {"title": "The Pinkertons Still Never Sleep", "description": "The notorious union-busting agency has resurfaced in a telecommunications labor dispute, revealing how it has adapted to the 21st century.", "url": "https://newrepublic.com/article/147619/pinkertons-still-never-sleep", "hostname": "newrepublic.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221994"}, {"title": "Red Dead Redemption Studio Sued by Pinkerton Agency - Rockstar Sues Back | The Nerdy", "description": "The legendary Pinkerton agency is suing Rockstar and Take-Two Interactive for use of its name in Red Dead Redemption II.", "url": "https://thenerdy.com/red-dead-redemption-pinkerton-lawsuit/", "hostname": "thenerdy.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19222043"}, {"title": "Law section", "description": "(a) Any provision in an employment agreement which provides that an employee shall assign, or offer to assign, any of his or her rights in an invention to his or her employer shall not apply to an invention that the employee developed entirely on his or her own time without using the employer’s equipment, supplies, facilities, or trade secret information except for those inventions that either:  ", "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=2870", "hostname": "leginfo.legislature.ca.gov", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221808"}, {"title": "Personal Projects (IARC) â opensource.google.com", "description": null, "url": "https://opensource.google.com/docs/iarc/", "hostname": "opensource.google.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221344"}, {"title": "Get the code - Perkeep", "description": "Perkeep is built so that other apps can securely access and store\ndata without running alongside it. Perkeep is the perfect backing\nstore for other web apps and CMSes.", "url": "https://perkeep.org/code#contributing", "hostname": "perkeep.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221545"}, {"title": "google/souper", "description": "A superoptimizer for LLVM IR. Contribute to google/souper development by creating an account on GitHub.", "url": "https://github.com/google/souper", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19221314"}, {"title": "Federal Arbitration Act - Wikipedia", "description": "The United States Arbitration Act (Pub.L. 68–401, 43 Stat. 883, enacted February 12, 1925, codified at 9 U.S.C. ch. 1), more commonly referred to as the Federal Arbitration Act or FAA, is an act of Congress that provides for judicial facilitation of private dispute resolution through arbitration. It applies in both state courts and federal courts, as was held constitutional in Southland Corp. v. Keating. It applies where the transaction contemplated by the parties \"involves\" interstate commerce and is predicated on an exercise of the Commerce Clause powers granted to Congress in the U.S. Constitution.\n", "url": "https://en.wikipedia.org/wiki/Federal_Arbitration_Act", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19221189"}, {"title": "Epic Systems Corp. v. Lewis - Wikipedia", "description": "\n", "url": "https://en.wikipedia.org/wiki/Epic_Systems_Corp._v._Lewis", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19221189"}, {"title": "Fisher Phillips: Kentucky Becomes First State To Prohibit Mandatory Arbitration As A Condition of Employment", "description": "The Kentucky Supreme Court just outlawed mandatory arbitration agreements that require applicants or employees to sign if they want to be hired or remain employed, making the Bluegrass State the first in the nation to do so.", "url": "https://www.fisherphillips.com/resources-alerts-kentucky-becomes-first-state-to-prohibit-mandatory", "hostname": "www.fisherphillips.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221160"}, {"title": "Forced into arbitration, 12,500 drivers claim Uber won’t pay fees...", "description": "Uber fought as hard as any company in America in the past few years to assure th...", "url": "https://www.reuters.com/article/legal-us-otc-uber/forced-into-arbitration-12500-drivers-claim-uber-wont-pay-fees-to-launch-cases-idUSKBN1O52C6", "hostname": "www.reuters.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221319"}, {"title": "The arbitration epidemic: Mandatory arbitration deprives workers and consumers of their rights", "description": "The Supreme Court has engineered a massive shift in the civil justice system that is having dire consequences for consumers and employees. By enabling large corporations to force customers and employees into arbitration to adjudicate practically all types of alleged violations, the Court now permits corporations to write the rules that will govern their relationships with their workers and customers and design the procedures used to interpret and apply those rules when disputes arise.", "url": "https://www.epi.org/publication/the-arbitration-epidemic/#epi-toc-13", "hostname": "www.epi.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221132"}, {"title": "The Philosophy of Open Source in Community and Enterprise Software", "description": null, "url": "https://penguindreams.org/blog/the-philosophy-of-open-source-in-community-and-enterprise-software/", "hostname": "penguindreams.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19222110"}, {"title": "Practical Go: Real world advice for writing maintainable Go programs", "description": "Hello,", "url": "https://dave.cheney.net/practical-go/presentations/qcon-china.html", "hostname": "dave.cheney.net", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19218097"}, {"title": "Rob Pike: Notes on Programming in C", "description": "Sections:", "url": "http://doc.cat-v.org/bell_labs/pikestyle", "hostname": "doc.cat-v.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221086"}, {"title": "research!rsc: Names", "description": "Every programmer has a variable naming philosophy.\nThis is mine:\n\n\n\nA name's length should not exceed its information content.\nFor a local variable, the name i conveys\nas much information as index or idx and is quicker to read.\nSimilarly, i and j are a better pair of names for\nindex variables than i1 and i2 (or, worse, index1 and index2),\nbecause they are easier to tell apart when skimming\nthe program.\nGlobal names must convey relatively more information,\nbecause they appear in a larger variety of contexts.\nEven so, a short, precise name can say more than a long-winded one:\ncompare \nacquire\nand take_ownership.\nMake every name tell.\n\n\nThe information content metric gives a quantitative\nargument against long-winded names: they're simply inefficient.\nI internalized this metric years ago but only realized this phrasing of it\nrecently,\nperhaps because I have been looking at\ntoo much Java code.\n", "url": "https://research.swtch.com/names", "hostname": "research.swtch.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221788"}, {"title": "Jonathan Blow's home page", "description": null, "url": "http://number-none.com/blow/john_carmack_on_inlined_code.html", "hostname": "number-none.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220287"}, {"title": "torvalds/linux", "description": "Linux kernel source tree. Contribute to torvalds/linux development by creating an account on GitHub.", "url": "https://github.com/torvalds/linux/blob/master/net/ipv4/tcp.c#L1174", "hostname": "github.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221015"}, {"title": "A Philosophy of Software Design by John Ousterhout [Talk]", "description": "“A Philosophy of Software Design” by John Ousterhout", "url": "http://alex-ii.github.io/notes/2018/10/07/philosophy_of_software_design.html", "hostname": "alex-ii.github.io", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219883"}, {"title": "Single responsibility principle - Wikipedia", "description": "The single responsibility principle is a computer programming principle that states that every module, class, or function[1] should have responsibility over a single part of the functionality provided by the software, and that responsibility should be entirely encapsulated by the class. All its services should be narrowly aligned with that responsibility. Robert C. Martin expresses the principle as, \"A class should have only one reason to change,\"[1] although, because of confusion around the word \"reason\" he more recently stated \"This principle is about people.\"[2]\n", "url": "https://en.wikipedia.org/wiki/Single_responsibility_principle", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19219948"}, {"title": "airbnb/javascript", "description": "JavaScript Style Guide. Contribute to airbnb/javascript development by creating an account on GitHub.", "url": "https://github.com/airbnb/javascript", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19218765"}, {"title": "1 Introduction", "description": null, "url": "https://docs.racket-lang.org/plot/intro.html?q=graph#%28part._.Plotting_3.D_.Graphs%29", "hostname": "docs.racket-lang.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219376"}, {"title": "API — Flask 1.0.2 documentation", "description": "This part of the documentation covers all the interfaces of Flask.  For\nparts where Flask depends on external libraries, we document the most\nimportant right here and provide links to the canonical documentation.", "url": "http://flask.pocoo.org/docs/1.0/api/#api", "hostname": "flask.pocoo.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219685"}, {"title": "http - The Go Programming Language", "description": "\nPackage http provides HTTP client and server implementations.\n", "url": "https://golang.org/pkg/net/http/", "hostname": "golang.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219685"}, {"title": "Package http", "description": "Package http provides HTTP client and server implementations.", "url": "https://godoc.org/net/http", "hostname": "godoc.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220511"}, {"title": "Package http", "description": "Package http provides HTTP client and server implementations.", "url": "https://godoc.org/net/http#HandleFunc", "hostname": "godoc.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220511"}, {"title": "I/O from the Command Line (The Java™ Tutorials >        \n            Essential Classes > Basic I/O)\n", "description": "This Java tutorial describes exceptions, basic input/output, concurrency, regular expressions, and the platform environment", "url": "https://docs.oracle.com/javase/tutorial/essential/io/cl.html", "hostname": "docs.oracle.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221469"}, {"title": "bufio - The Go Programming Language", "description": "\nPackage bufio implements buffered I/O. It wraps an io.Reader or io.Writer\nobject, creating another object (Reader or Writer) that also implements\nthe interface but provides buffering and some help for textual I/O.\n", "url": "https://golang.org/pkg/bufio/#example_Scanner_emptyFinalToken", "hostname": "golang.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221469"}, {"title": "Clean Code: A Handbook of Agile Software Craftsmanship: Robert C. Martin: 9780132350884: Amazon.com: Books", "description": "Clean Code: A Handbook of Agile Software Craftsmanship [Robert C. Martin] on Amazon.com. *FREE* shipping on qualifying offers. Even bad code can function. But if code isn’t clean, it can bring a development organization to its knees. Every year", "url": "https://www.amazon.com/Clean-Code-Handbook-Software-Craftsmanship/dp/0132350882/ref=sr_1_2?s=books&ie=UTF8&qid=1550785898&sr=1-2&keywords=beautiful+code", "hostname": "www.amazon.com", "category": "amazon_item", "comment_url": "https://news.ycombinator.com/item?id=19220888"}, {"title": "Effective Go - The Go Programming Language", "description": "\nGo is a new language.  Although it borrows ideas from\nexisting languages,\nit has unusual properties that make effective Go programs\ndifferent in character from programs written in its relatives.\nA straightforward translation of a C++ or Java program into Go\nis unlikely to produce a satisfactory result—Java programs\nare written in Java, not Go.\nOn the other hand, thinking about the problem from a Go\nperspective could produce a successful but quite different\nprogram.\nIn other words,\nto write Go well, it's important to understand its properties\nand idioms.\nIt's also important to know the established conventions for\nprogramming in Go, such as naming, formatting, program\nconstruction, and so on, so that programs you write\nwill be easy for other Go programmers to understand.\n", "url": "https://golang.org/doc/effective_go.html", "hostname": "golang.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19222040"}, {"title": "Asciidoctor User Manual", "description": "This guide describes the Asciidoctor attributes, values, and layout options available for producing a customized and polished document.", "url": "https://asciidoctor.org/docs/user-manual/", "hostname": "asciidoctor.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221230"}, {"title": "V programming language", "description": "V programming language", "url": "http://vlang.io", "hostname": "vlang.io", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19218749"}, {"title": "vlang-io/V", "description": "Contribute to vlang-io/V development by creating an account on GitHub.", "url": "https://github.com/vlang-io/V/blob/master/examples/users.v", "hostname": "github.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219113"}, {"title": "Segment Startup Program | Segment", "description": "We’ve created a program to help early-stage startups collect and control their customer data for free for up to two years. Apply today.", "url": "https://segment.com/startups/", "hostname": "segment.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220518"}, {"title": "Segment | Customer Data Infrastructure (CDI)", "description": null, "url": "https://segment.com/academy/choosing-stack/how-stacks-evolve/", "hostname": "segment.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221293"}, {"title": "Centrifuge: a reliable system for delivering billions of events per day", "description": null, "url": "https://segment.com/blog/introducing-centrifuge/", "hostname": "segment.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221293"}, {"title": "Indicative | Behavioral Analytics, Free From Limits", "description": "Growth marketers, product managers, and data analysts use Indicative to optimize customer conversion, engagement, and retention.", "url": "https://www.indicative.com", "hostname": "www.indicative.com", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19221772"}, {"title": "Here's why we're entering the Golden Age of Podcasts (in 10 graphs)", "description": "Spotify's acquisition of Gimlet Media and Anchor signals the beginning of the Golden Age of Podcasts. It's the culmination of many trends: More listeners, more content, more kinds of content, more ways to listen, and the convergence of larger tech adoption curves.", "url": "https://chartable.com/blog/golden-age-of-podcasts", "hostname": "chartable.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19217575"}, {"title": "List of radio stations owned by iHeartMedia - Wikipedia", "description": "The following is a list of radio stations currently owned by iHeartMedia. Of these stations, 448 of the stations which are outside the Top 100 DMA markets, plus another 91 stations which may or may not be in the top 100 DMAs are for sale. The TV stations formerly owned by Clear Channel were sold to Providence Equity Partners, a private equity firm, on April 23, 2007, with the deal closing in late November 2007. 185 radio stations were to have been sold to GoodRadio.TV LLC until the sale fell apart over financing.,[1][2] and another 177 stations have been sold to other entities.[3] Another 201 stations are up for sale.[4]\n", "url": "https://en.wikipedia.org/wiki/List_of_radio_stations_owned_by_iHeartMedia", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19218587"}, {"title": "StartUp Podcast", "description": null, "url": "https://feeds.megaphone.fm/startup", "hostname": "feeds.megaphone.fm", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219445"}, {"title": "Podcasts from tech companies | Listen Notes", "description": "A curated playlist of podcasts by Wenbin Fang.", "url": "https://www.listennotes.com/listen/podcasts-from-tech-companies-zIg-6iPWJOy/?display=podcast", "hostname": "www.listennotes.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220195"}, {"title": "Restructuring Will Wipe $10 Billion Of iHeartMedia’s Debt.", "description": "Months of ongoing negotiations between iHeartMedia and its debt holders has resulted in a deal that will wipe more than $10 billion of outstanding debt from its balance sheet. It", "url": "http://www.insideradio.com/free/restructuring-will-wipe-billion-of-iheartmedia-s-debt/article_a8f332f0-28e7-11e8-aa69-af3eb5d38002.html", "hostname": "www.insideradio.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220327"}, {"title": "The Ongoing History of New Music - Wikipedia", "description": "The Ongoing History of New Music is a radio program produced in Canada by Corus Entertainment and hosted by Alan Cross.[1] It is syndicated to several other radio stations, mostly but not exclusively Corus-owned, across Canada.\n", "url": "https://en.wikipedia.org/wiki/The_Ongoing_History_of_New_Music", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19218983"}, {"title": "Podcast  |  Search\n       |  Google Developers", "description": null, "url": "https://developers.google.com/search/docs/data-types/podcast", "hostname": "developers.google.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19218314"}, {"title": "Listen Notes: The best podcast search engine", "description": "The most comprehensive podcast database online. Discover best podcasts. Search podcast show notes and audio transcripts by people, places, or topics.", "url": "https://www.listennotes.com", "hostname": "www.listennotes.com", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19219498"}, {"title": "Dan Carlin", "description": "He’s been called a lot of things, but no one says that Dan Carlin is boring. His two long-running podcasts are among the most popular in the world. Part storyteller, part analyst, Carlin has mastered the art of looking at subjects from multiple angles and dissecting and thinking about them in original ways. He isn’t afraid to go deep or to inject historical context into modern debates. Whether it’s history or current events he’s discussing, his passion is contagious, his approach refreshing and his ideas tickle your brain in all the right places. He’ll make you mad too. You’ll like it.", "url": "https://www.dancarlin.com", "hostname": "www.dancarlin.com", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19219816"}, {"title": "Buy Podcasts (beta) - Microsoft Store en-IN", "description": "Download this app from Microsoft Store for Windows 10, Windows 10 Mobile, Windows 10 Team (Surface Hub), HoloLens, Xbox One. See screenshots, read the latest customer reviews, and compare ratings for Podcasts (beta). ", "url": "https://www.microsoft.com/en-in/p/podcasts-beta/9nblggh1zj3r?activetab=pivot:overviewtab", "hostname": "www.microsoft.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220464"}, {"title": "Reading Rainbow 🌈 Theme Song (Classic)", "description": "One of my favorite childhood show theme songs. Reading Rainbow 🌈 (PLEASE SUBSCRIBE)", "url": "https://www.youtube.com/watch?v=uPqpmSWwuGk&feature=youtu.be", "hostname": "www.youtube.com", "category": "video", "comment_url": "https://news.ycombinator.com/item?id=19218147"}, {"title": "LeVar Burton reads \"Go The Fuck To Sleep\"", "description": "LeVar Burton reads Go the fuck to sleep on the RoosterTeeth Extra Life stream. ForTheKids", "url": "https://www.youtube.com/watch?v=FBHwmVlP_DE", "hostname": "www.youtube.com", "category": "video", "comment_url": "https://news.ycombinator.com/item?id=19218931"}, {"title": "BBC Radio - The Grenfell Tower Inquiry with Eddie Mair - Downloads", "description": "Podcast downloads for The Grenfell Tower Inquiry with Eddie Mair", "url": "https://www.bbc.co.uk/programmes/p066rd9t/episodes/downloads", "hostname": "www.bbc.co.uk", "category": "news", "comment_url": "https://news.ycombinator.com/item?id=19218070"}, {"title": "BBC Radio 4 - Analysis - Downloads", "description": "Podcast downloads for Analysis", "url": "https://www.bbc.co.uk/programmes/b006r4vz/episodes/downloads", "hostname": "www.bbc.co.uk", "category": "news", "comment_url": "https://news.ycombinator.com/item?id=19218070"}, {"title": "BBC Radio - Podcasting House - Downloads", "description": "Podcast downloads for Podcasting House", "url": "https://www.bbc.co.uk/programmes/p05ltqxn/episodes/downloads", "hostname": "www.bbc.co.uk", "category": "news", "comment_url": "https://news.ycombinator.com/item?id=19218185"}, {"title": "Hindenburg Crash - How It Really Sounded", "description": "Hear a corrected version of the famous Hindenburg crash broadcast. This is how reporter Herbert Morrison really sounded.", "url": "https://www.youtube.com/watch?v=pUVDmXvXcbk&feature=youtu.be&t=39", "hostname": "www.youtube.com", "category": "video", "comment_url": "https://news.ycombinator.com/item?id=19218669"}, {"title": "r/podcasts", "description": null, "url": "https://www.reddit.com/r/podcasts", "hostname": "www.reddit.com", "category": "subreddit", "comment_url": "https://news.ycombinator.com/item?id=19218110"}, {"title": "Retronauts 1 - 100 : Free Download, Borrow, and Streaming : Internet Archive", "description": "The Early Years: Episodes 1-62------------------------------This was the golden era of the podcast, when 1up was owned by Ziff Davis Media (for the first...", "url": "https://archive.org/details/Retronauts1-100", "hostname": "archive.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219874"}, {"title": "1UP Podcast Preservation", "description": "One of my favorite threads at the Other Place was the \"Official 1UP Podcast Preservation Society,\" where Aselith and other users compiled links to archives of the various 1UP podcasts.\n\nThankfully a lot of this stuff is hosted on archive.org now, but unfortunately with 1UP.com shutting down in...", "url": "https://www.resetera.com/threads/1up-podcast-preservation.90181/", "hostname": "www.resetera.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219874"}, {"title": "A Life Well Wasted ", "description": "A Life Well Wasted is an internet radio show about videogames and the people who love them.", "url": "http://alifewellwasted.com", "hostname": "alifewellwasted.com", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19219874"}, {"title": "Articulu | Listen to Articles from the Web", "description": "A better way to read the internet. Hands free and On The Go.", "url": "https://articulu.com", "hostname": "articulu.com", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19221074"}, {"title": "The Best Podcasts of 2018", "description": "I analyzed 522 recommendations from 25 different critics' best-of lists to find the best of the best podcasts of 2018. Plus: the podcasts which got the most reviews this year, and charted on the most global charts.", "url": "https://chartable.com/blog/the-best-podcasts-of-2018", "hostname": "chartable.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19218038"}, {"title": "New Demographic Research Shows Who Really Listens to Podcasts", "description": "New podcast research and podcast statistics from Edison Research show who listens to podcast in America in 2017.", "url": "https://www.convinceandconvert.com/podcast-research/new-demographic-research-shows-who-really-listens-to-podcasts/", "hostname": "www.convinceandconvert.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219604"}, {"title": "Listen API: Podcast Search & Directory API", "description": "Simple & no-nonsense podcast search API & podcast directory API. Search all podcasts and episodes by people, places, or topics.", "url": "https://www.listennotes.com/api/", "hostname": "www.listennotes.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219157"}, {"title": "fyyd.de: Podcast, Search, Engine And Curation", "description": "fyyd: A podcast searchengine", "url": "https://fyyd.de/charts", "hostname": "fyyd.de", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219012"}, {"title": "Hörspiele zum Download und als Podcast", "description": "Hört doch, was ihr wollt: packende, innovative und aktuelle Hörspiele zum Download!", "url": "https://www1.wdr.de/mediathek/audio/hoerspiel-speicher/wdr_hoerspielspeicher150.html", "hostname": "www1.wdr.de", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219012"}, {"title": "Y Combinator Podcast - YouTube", "description": null, "url": "https://www.youtube.com/playlist?list=PLQ-uHSnFig5PACZiyiDk1O24Zm9wxAEUi", "hostname": "www.youtube.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19218641"}, {"title": "Leonard Susskind on Richard Feynman, the Holographic Principle, and Unanswered Questions in Physics", "description": "Leonard Susskind is a professor of theoretical physics at Stanford University and he’s regarded as one of the fathers of string theory. https://en.wikipedia....", "url": "https://www.youtube.com/watch?v=CQAcLW6qdQY&list=PLQ-uHSnFig5PACZiyiDk1O24Zm9wxAEUi&index=102", "hostname": "www.youtube.com", "category": "video", "comment_url": "https://news.ycombinator.com/item?id=19218641"}, {"title": "Office Hours with Michael Seibel", "description": "Michael Seibel - https://twitter.com/mwseibel - is a Partner and the CEO of YC. He cofounded Justin.tv, which was in the Winter 2007 batch and Socialcam, whi...", "url": "https://www.youtube.com/watch?v=JJ2BWOT4hfs&t=0s&list=PLQ-uHSnFig5PACZiyiDk1O24Zm9wxAEUi&index=86", "hostname": "www.youtube.com", "category": "video", "comment_url": "https://news.ycombinator.com/item?id=19218641"}, {"title": "Peter Reinhardt on Finding Product Market Fit at Segment", "description": "Peter Reinhardt - https://twitter.com/reinpk - is cofounder and CEO of Segment - https://segment.com/ Segment helps companies capture data from every custome...", "url": "https://www.youtube.com/watch?v=l-vfn97QTr0&t=0s&list=PLQ-uHSnFig5PACZiyiDk1O24Zm9wxAEUi&index=89", "hostname": "www.youtube.com", "category": "video", "comment_url": "https://news.ycombinator.com/item?id=19218641"}, {"title": "Podcast: The (Big?) Business Of Podcasting [Ep.200]", "description": "We can hardly believe it, but as of this moment we've released 200 episodes of the Techdirt podcast! For this milestone, we've brought the increasingly-rare original team of co-hosts back together for a bit of a meta-episode all about...", "url": "https://www.techdirt.com/articles/20190219/12502141633/techdirt-podcast-episode-200-big-business-podcasting.shtml", "hostname": "www.techdirt.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219872"}, {"title": "COI - Chat Over IMAP", "description": null, "url": "https://www.coi-dev.org", "hostname": "www.coi-dev.org", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19216077"}, {"title": "xkcd: Standards", "description": "\nThis work is licensed under a\nCreative Commons Attribution-NonCommercial 2.5 License.\n", "url": "https://xkcd.com/927/", "hostname": "xkcd.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19217135"}, {"title": "xkcd: Chat Systems", "description": "\nThis work is licensed under a\nCreative Commons Attribution-NonCommercial 2.5 License.\n", "url": "https://xkcd.com/1810/", "hostname": "xkcd.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19217200"}, {"title": "How do I bridge thee?  Let me count the ways… | Matrix.org", "description": " by Matthew Hodgson | Mar 11, 2017 | Tech | 2 comments", "url": "https://matrix.org/blog/2017/03/11/how-do-i-bridge-thee-let-me-count-the-ways/", "hostname": "matrix.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19217318"}, {"title": "Petraeus scandal - Wikipedia", "description": "The Petraeus scandal is a series of events that garnered strong media attention when an extramarital affair between retired four-star general David Petraeus, then Director of the Central Intelligence Agency (CIA),  and Paula Broadwell became public information. Petraeus had chosen Broadwell to be his official biographer. She co-authored All In: The Education of General David Petraeus, his biography, when Petraeus was the International Security Assistance Force commander.[1][2] On November 9, 2012, she was reported to have been involved in the extramarital affair with Petraeus that triggered his resignation as Director of the Central Intelligence Agency when it was discovered by the FBI.[3]\n", "url": "https://en.wikipedia.org/wiki/Petraeus_scandal", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19220222"}, {"title": "matrix-org/matrix-doc", "description": "Matrix Documentation (including The Spec). Contribute to matrix-org/matrix-doc development by creating an account on GitHub.", "url": "https://github.com/matrix-org/matrix-doc/blob/matthew/msc1763/proposals/1763-configurable-retention-periods.md", "hostname": "github.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216375"}, {"title": "Dino - Communicating happiness", "description": "Dino is a modern open-source chat client for the desktop. It focuses on providing a clean and reliable Jabber/XMPP experience while having your privacy in mind.", "url": "https://dino.im", "hostname": "dino.im", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19220870"}, {"title": "Poezio", "description": null, "url": "https://poez.io/en/", "hostname": "poez.io", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220870"}, {"title": "Converse", "description": "Converse: An XMPP chat client which can be integrated into any website", "url": "https://conversejs.org", "hostname": "conversejs.org", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19220870"}, {"title": "Movim â Responsive web-based cross-platform XMPP client", "description": "Movim is a kickass distributed social platform, with web client and mobile apps, that protects your privacy, comes with a set of awesome features and uses the industry-standard XMPP protocol", "url": "https://movim.eu/#try", "hostname": "movim.eu", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220870"}, {"title": "FOSDEM 2019 - Breaking the 100 bits per second barrier with Matrix", "description": null, "url": "https://fosdem.org/2019/schedule/event/matrix/", "hostname": "fosdem.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19217412"}, {"title": "atom/xray", "description": "An experimental next-generation Electron-based text editor - atom/xray", "url": "https://github.com/atom/xray/tree/master/memo_core", "hostname": "github.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221781"}, {"title": "Code together in real time in Atom", "description": "Teletype for Atom lets developers share their workspace with team members and collaborate on code in real time.", "url": "https://teletype.atom.io", "hostname": "teletype.atom.io", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19221781"}, {"title": "biboumi, XMPP gateway to IRC", "description": "XMPP gateway to IRC.", "url": "https://biboumi.louiz.org", "hostname": "biboumi.louiz.org", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19216619"}, {"title": "Re: Matrix as a replacement for Telepathy", "description": " Copyright © 2005 -  The GNOME Project.\nOptimised for standards. Hosted by Red Hat.\n        Powered by MailMan, Python and GNU.", "url": "https://mail.gnome.org/archives/desktop-devel-list/2017-September/msg00047.html", "hostname": "mail.gnome.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216619"}, {"title": "kamax-matrix/matrix-appservice-email", "description": "Matrix <--> E-mail Bridge. Contribute to kamax-matrix/matrix-appservice-email development by creating an account on GitHub.", "url": "https://github.com/kamax-matrix/matrix-appservice-email", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19217497"}, {"title": "Wie ein neuer Whatsapp-Konkurrent entstehen soll", "description": "Der Open-Source-Unternehmer Rafael Laguna will dominierenden Messenger-Diensten Paroli bieten - und seine Chancen stehen gut.", "url": "https://www.sueddeutsche.de/digital/whatsapp-konkurrent-open-source-rafael-laguna-1.4336574", "hostname": "www.sueddeutsche.de", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216520"}, {"title": "Delta Chat - Open Source Email Based Instant Messenger", "description": "Delta Chat - Email Based Secure Instant Messenger", "url": "https://delta.chat", "hostname": "delta.chat", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19216205"}, {"title": "FOSDEM 2019 - Break the Messaging Silos with COI", "description": null, "url": "https://fosdem.org/2019/schedule/event/chat_over_imap/", "hostname": "fosdem.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216346"}, {"title": "deltachat/deltachat-desktop", "description": "Desktop Application for https://delta.chat. Contribute to deltachat/deltachat-desktop development by creating an account on GitHub.", "url": "https://github.com/deltachat/deltachat-desktop", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19216228"}, {"title": "Delta Chat", "description": "Instant E-Mail Messaging. Delta Chat has 20 repositories available. Follow their code on GitHub.", "url": "https://github.com/deltachat", "hostname": "github.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216283"}, {"title": "deltachat/deltachat-core", "description": "Delta.Chat C-Library with e2e chat-over-email functionality & Python bindings - deltachat/deltachat-core", "url": "https://github.com/deltachat/deltachat-core", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19216283"}, {"title": "deltachat/spec", "description": "E-mail-chat protocol specification. Contribute to deltachat/spec development by creating an account on GitHub.", "url": "https://github.com/deltachat/spec/blob/master/spec.md", "hostname": "github.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216283"}, {"title": "Helm | Encrypted Email, Contacts, Calendar", "description": "Protect your private data from hacking, surveillance, and corporate data mining with the Helm Personal Server. Engineered with advanced encryption and security features to keep your emails, contacts, and calendars protected and private.", "url": "https://thehelm.com", "hostname": "thehelm.com", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19216365"}, {"title": "COI Client Specification v1.0 - COI Wiki - Open-Xchange Public Confluence", "description": "Status: DRAFT", "url": "https://confluence-public.open-xchange.com/display/CoiW/COI+Client+Specification+v1.0", "hostname": "confluence-public.open-xchange.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220770"}, {"title": "Threema - Seriously secure messaging", "description": null, "url": "https://threema.ch/en", "hostname": "threema.ch", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19217543"}, {"title": "send and receive contacts (vCard) properly · Issue #6520 · signalapp/Signal-Android", "description": "I have: read https://github.com/WhisperSystems/Signal-Android/wiki/Submitting-useful-bug-reports searched open and closed issues for duplicates Hi 😄 This is a fresh feature request for #535 and #14...", "url": "https://github.com/signalapp/Signal-Android/issues/6520#issuecomment-304572373", "hostname": "github.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219658"}, {"title": "send and receive contacts (vCard) properly · Issue #6520 · signalapp/Signal-Android", "description": "I have: read https://github.com/WhisperSystems/Signal-Android/wiki/Submitting-useful-bug-reports searched open and closed issues for duplicates Hi 😄 This is a fresh feature request for #535 and #14...", "url": "https://github.com/signalapp/Signal-Android/issues/6520#issuecomment-370671001", "hostname": "github.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219658"}, {"title": "ID4me – One ID for everything, everywhere", "description": "Tired of remembering hundreds of usernames and passwords? With ID4me, you only have one account to manage - and you can add as much information into it as you like, so that you never have to type it again.", "url": "https://id4me.org", "hostname": "id4me.org", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19219377"}, {"title": "deltachat/deltachat-android", "description": "Email-based instant messaging for Android. Contribute to deltachat/deltachat-android development by creating an account on GitHub.", "url": "https://github.com/deltachat/deltachat-android", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19217247"}, {"title": "Home | Open-Xchange", "description": "Open-Xchange is the pioneer of open and trusted software and solutions for service providers worldwide who are challenged with extending value and innovation", "url": "https://www.open-xchange.com", "hostname": "www.open-xchange.com", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19218388"}, {"title": "Dovecot", "description": "Older news...", "url": "https://www.dovecot.org", "hostname": "www.dovecot.org", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19218388"}, {"title": "Spike - the world's first conversational email app", "description": "Spike makes working easier and more efficient. Saving you and your team time, sanity, and a lot of headaches.", "url": "https://www.spikenow.com", "hostname": "www.spikenow.com", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19218388"}, {"title": "STMicro STM32MP1 Cortex A7/M4 MPU Supports Linux and Android", "description": "When Linux 4.17 was released last June, we discovered an interesting new STM32 part: STM32MP157C dual core Cortex-A7 processor. It was the first time I", "url": "https://www.cnx-software.com/2019/02/21/stmicro-stm32mp1-cortex-a7-m4-mpu/", "hostname": "www.cnx-software.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219680"}, {"title": "LibOpenCM3 by libopencm3", "description": "Open-Source lowlevel hardware library for ARM Cortex-M3 microcontrollers (but also M0, M4 are supported and more to come)", "url": "http://libopencm3.org", "hostname": "libopencm3.org", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19221674"}, {"title": "libopencm3/libopencm3-examples", "description": "Simple example projects showing how to use libopencm3. - libopencm3/libopencm3-examples", "url": "https://github.com/libopencm3/libopencm3-examples", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19221674"}, {"title": "libopencm3/libopencm3-template", "description": "Simple empty template to base your poject on. Contribute to libopencm3/libopencm3-template development by creating an account on GitHub.", "url": "https://github.com/libopencm3/libopencm3-template", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19221674"}, {"title": "NXP Tops Microcontroller Supplier Ranking", "description": "Acquisitions by NXP, Microchip and Cypress had a big impact on the ranking of microcontroller suppliers in 2016.", "url": "https://epsnews.com/2017/05/01/nxp-tops-microcontroller-supplier-ranking/", "hostname": "epsnews.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220673"}, {"title": "\n    STM32MP157C-DK2 - Discovery kit with STM32MP157C MPU - STMicroelectronics\n\n\n", "description": "STM32MP157C-DK2 - Discovery kit with STM32MP157C MPU, STM32MP157C-DK2, STMicroelectronics", "url": "https://www.st.com/content/st_com/en/products/evaluation-tools/product-evaluation-tools/mcu-mpu-eval-tools/stm32-mcu-mpu-eval-tools/stm32-discovery-kits/stm32mp157c-dk2.html", "hostname": "www.st.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220910"}, {"title": "\n    STM32MP157C - MPU with Arm Dual Cortex-A7 650 MHz, Arm Cortex-M4 real-time coprocessor, 3D GPU, TFT/MIPI DSI displays, FD-CAN, Secure boot and Cryptography - STMicroelectronics\n\n\n", "description": "STM32MP157C - MPU with Arm Dual Cortex-A7 650 MHz, Arm Cortex-M4 real-time coprocessor, 3D GPU, TFT/MIPI DSI displays, FD-CAN, Secure boot and Cryptography, STM32MP157CAC3, STM32MP157CAD3, STM32MP157CAC3T, STM32MP157CAA3, STM32MP157CAB3T, STM32MP157CAB3, STM32MP157CAD3T, STM32MP157CAA3T, STMicroelectronics", "url": "https://www.st.com/content/st_com/en/products/microcontrollers-microprocessors/stm32-arm-cortex-mpus/stm32mp1-series/stm32mp157/stm32mp157c.html", "hostname": "www.st.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221018"}, {"title": "Shoreline Firewall (Shorewall) / [Shorewall-announce] The end of the road...", "description": "\nYou seem to have CSS turned off.\n        Please don't fill out this field.\n", "url": "https://sourceforge.net/p/shorewall/mailman/message/36589783/", "hostname": "sourceforge.net", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219212"}, {"title": " [Shorewall-users] I quit.\n   ", "description": "\nPrevious message: [Shorewall-users] open ports confusion\n\nNext message: [Shorewall-users] I quit.\n\n Messages sorted by:\n[ date ]\n[ thread ]\n[ subject ]\n[ author ]\n\n\n\n\nIt is with regret that I announce that Shorewall development and support is\nofficially ended.\n\nSean's post has finally driven it home to me that in the long term, trying\nto support a project like Shorewall is impossible for a person of my\npersonality and age.\n\nSean -- please believe that this isn't about you or your post -- your post\nwas just the proverbial straw on this old camel's back.\n\nUnlike the originators of other successful open source projects, I have not\nbeen able to attract a core of people who believe in Shorewall and who are\nwilling to make sacrifices to ensure it's success. That is my weakness and I\naccept it. But is means that I have been left with trying to develop,\ndocument, and support Shorewall almost single-handedly. I cannot do it any more.\n\nI have apparently been able to create the illusion of more success than has\nbeen achieved. Sean believes that he should be able to ignore the notices on\nthe Shorewall 1.3 web site announcing that support for that release has\nceased and thinks that the errata page should still have updated Shorewall\ncomponents for a release that my 60 year old mind can't remember most of the\ndetails about. And he is right to expect that. But I can't deliver it.\n\nAnd I just cannot deal with the support and documentation frustration any\nmore -- support, the documentation and the web site consume an order of\nmagnitude more of my time than does Shorewall development. Apparently, I am\ncompletely inept at web site design because people just can't find the\ninformation that they need; and I have no more energy to try to fix it.\n\nSince I began developing Shorewall:\n\na) I have gained over 60 pounds in weight.\nb) My lawn and landscaping have become an embarrassment in the neighborhood.\nc) I have begun exhibiting addictive behavior toward Linux and Shorewall.\nd) I have developed sleep disorders (I use a breathing aid at night)\ne) I dislike my life.\n\nIt's time to get myself cleaned up and re-enter the life of the living.\n\nI will leave the Shorewall website and server in place until July 4 in case\nthere is any community interest in picking up the pieces. Please email me\nprivately if you are interested in carrying on; I'll do what I can to help.\n\nTonight I am deleting myself from all of the Shorewall and Leaf mailing lists.\n\nI will clean up what I have for a 2.3 release and place it on the server as\nthe last Shorewall release -- Shorewall 2.4.0.\n\nI would like to express my appreciation for all who have used Shorewall and\nwho have enriched my life through Shorewall. I especially appreciate:\n\n- Steve Cowles who helped me so much in the early days\n- Francesca Smith who picked up the sample configurations when I had had it\nwith them\n- Mike Noyes who was always willing to help improve the documentation.\n\nI regret letting down those of you who depend on Shorewall. But look at it\nthis way -- you have the source for all of the code that you run and it's\nall written in a very simple programming language. And there was always the\npossiblilty that I would walk in front of a bus.\n\n... and you have to admit that the price was right :-)\n\nShorewall will always be a part of my life that I look back on with fondness.\n\nAs always,\n\n-Tom\n-- \nTom Eastep    \\ Nothing is foolproof to a sufficiently talented fool\nShoreline,     \\ http://shorewall.net\nWashington USA  \\ teastep at shorewall.net\nPGP Public Key   \\ https://lists.shorewall.net/teastep.pgp.key\n-------------- next part --------------\nAn embedded message was scrubbed...\nFrom: Sean Covel <seanecovel at comcast.net>\nSubject: Re: [leaf-user] New RFC1918 file needed?\nDate: Tue, 17 May 2005 22:02:18 -0400\nSize: 4866\nUrl: http://lists.shorewall.net/pipermail/shorewall-users/attachments/20050517/1554ab1a/leaf-userNewRFC1918fileneeded.mht\n\n\n\n\n\nPrevious message: [Shorewall-users] open ports confusion\n\nNext message: [Shorewall-users] I quit.\n\n Messages sorted by:\n[ date ]\n[ thread ]\n[ subject ]\n[ author ]\n\n\n\nMore information about the Shorewall-users\nmailing list\n", "url": "http://lists.shorewall.net/pipermail/shorewall-users/2005-May/018444.html", "hostname": "lists.shorewall.net", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221523"}, {"title": "How to set up a mail server on a GNU / Linux system", "description": "\n\t\tEasy to follow howto on setting up a mail server\n\t\twith unlimited users and domains,\n\t\twith IMAP access, anti-spam, anti-virus,\n\t\tsecure authentication, encrypted traffic,\n\t\tweb mail interface and more.\n\t", "url": "http://flurdy.com/docs/postfix/#config-simple-firewall", "hostname": "flurdy.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221438"}, {"title": "Router - ArchWiki", "description": "This article is a tutorial for turning a computer into an internet gateway/router. To strengthen its security it should not run any services available to the outside world. Towards the LAN, run only gateway specific services; especially do not run httpd, ftpd, samba, nfsd, etc. as those belong on a server in the LAN since they introduce security risks.\n", "url": "https://wiki.archlinux.org/index.php/Router", "hostname": "wiki.archlinux.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221813"}, {"title": "Yelp fired manager after he didn’t take calls, check email ’24/7/365′, lawsuit claims", "description": "Boss sent Mark Weathers a work email on Good Friday, then called him in church during Easter weekend to make him work, religious-discrimination suit alleges.", "url": "https://www.mercurynews.com/2019/02/20/yelp-fired-manager-after-he-didnt-take-calls-check-email-24-7-365-lawsuit-claims/", "hostname": "www.mercurynews.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220988"}, {"title": "Sabbath in Christianity - Wikipedia", "description": "Sabbath in Christianity is the inclusion or adoption in Christianity of a Sabbath day. Established within Judaism through Mosaic Law, Christians inherited a Sabbath practice that reflected two great precepts: the commandment to \"remember the sabbath day, to keep it holy\"[1] and God's blessing of the seventh day (Saturday) as a day of rest in the Genesis creation narrative and declared as made for man by Jesus. The first of these provisions was associated in Judaism with the assembly of the people to worship in the Temple in Jerusalem or in synagogues.\n", "url": "https://en.wikipedia.org/wiki/Sabbath_in_Christianity#Early_Christianity", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19221806"}, {"title": "Religious Discrimination", "description": "Religious discrimination involves treating a person (an applicant or employee) unfavorably because of his or her religious beliefs. The law protects not only people who belong to traditional, organized religions, such as Buddhism, Christianity,\nHinduism, Islam, and Judaism, but also others who have sincerely held religious, ethical or moral beliefs.", "url": "https://www.eeoc.gov/laws/types/religion.cfm", "hostname": "www.eeoc.gov", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221491"}, {"title": "WYSK: Workplace Religious Accommodation", "description": "1. Are employers required to accommodate the religious beliefs and practices of applicants and employees?", "url": "https://www.eeoc.gov/eeoc/newsroom/wysk/workplace_religious_accommodation.cfm", "hostname": "www.eeoc.gov", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221464"}, {"title": "Religious Discrimination - Workplace Fairness", "description": "Information about Religious Discrimination provided by job and employee rights advocacy organization Workplace Fairness.", "url": "https://www.workplacefairness.org/religious-discrimination", "hostname": "www.workplacefairness.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221436"}, {"title": "Holidays", "description": "Printer friendly version", "url": "https://www.dir.ca.gov/dlse/FAQ_Holidays.htm", "hostname": "www.dir.ca.gov", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221322"}, {"title": "Right to disconnect - Wikipedia", "description": "The right to disconnect is a proposed human right regarding the ability of people to disconnect from work and primarily not to engage in work-related electronic communications such as e-mails or messages during non-work hours.[1][2] The modern working environment has been drastically changed by new communication and information technologies. The boundary between work life and home life has shrunk with the introduction of digital tools into employment. While digital tools bring flexibility and freedom to employees they also can create an absence of limits, leading to excessive interference in the private lives of employees.[3] For this reason such a right is beneficial. Several countries, primarily in Europe, have some form of the right to disconnect included in their law, while in some cases it is present in the policy of many large companies. On July 24, 2018, the Petition 1057 called for introduction of the right to disconnect or as it is called in French “Le droit à la déconnexion” in the Labour Law in Luxembourg.[4]", "url": "https://en.m.wikipedia.org/wiki/Right_to_disconnect", "hostname": "en.m.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19221321"}, {"title": "Outline - Read & annotate without distractions", "description": "Outline is a free service for reading and annotating news articles. We remove the clutter so you can analyze and comment on the content.", "url": "https://outline.com/pHSqZN", "hostname": "outline.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221373"}, {"title": "Imgur", "description": null, "url": "https://imgur.com/a/qp57XAP", "hostname": "imgur.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221564"}, {"title": "Indonesia reports reduced deforestation, triggering first carbon payment from Norway", "description": null, "url": "https://www.norway.no/en/indonesia/norway-indonesia/news-events/news2/indonesia-reports-reduced-deforestation-triggering-first-carbon-payment-from-norway/", "hostname": "www.norway.no", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19215934"}, {"title": "Good buy, rainforests?", "description": "Tony Juniper: A millionaire has purchased a chunk of the Amazon forest to protect it, but there are drawbacks to this green strategy.", "url": "https://www.theguardian.com/commentisfree/2006/mar/24/cantwejustbuyalltherainf", "hostname": "www.theguardian.com", "category": "news", "comment_url": "https://news.ycombinator.com/item?id=19219372"}, {"title": "Green surprise: Why the world's forests are growing back", "description": "The return of the trees points to a way out of the climate crisis", "url": "https://www.theglobeandmail.com/opinion/we-are-making-the-globe-greener/article26147272/", "hostname": "www.theglobeandmail.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219372"}, {"title": "Forests are growing faster, ecologists discover; Climate change appears to be driving accelerated growth", "description": "Speed is not a word typically associated with trees; they can take centuries to grow. However, a new study finds evidence that forests in the Eastern United States are growing faster than they have in the past 225 years. The study offers a rare look at how an ecosystem is responding to climate change.", "url": "https://www.sciencedaily.com/releases/2010/02/100201171641.htm", "hostname": "www.sciencedaily.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219372"}, {"title": "Forests are growing - Facts - Keep me Posted EU", "description": "European forests have grown by over 30% since 1950 and are increasing by 1.5 million football pitches every year", "url": "http://www.keepmepostedeu.org/portfolio/growing-forests/", "hostname": "www.keepmepostedeu.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219372"}, {"title": "Yps (comics) - Wikipedia", "description": "Yps is a German comic book magazine which ran for over 1,000 issues from 1975 to 2000. In 2005 and 2006 several prototype issues were published, but the series was not revived. Loosely based on the French Pif Gadget, Yps was highly popular due to the toy 'Gimmick' included with every issue.\n", "url": "https://en.wikipedia.org/wiki/Yps_(comics)", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19221295"}, {"title": "Fraude à la TVA sur les quotas de carbone — Wikipédia", "description": "La fraude à la TVA sur les quotas de carbone, parfois improprement appelée « fraude à la taxe carbone », a pour cadre la bourse du carbone qui permet l’échange de droits (ou quotas) d’émission de CO2, le principal gaz à effet de serre d'origine anthropique. Elle aurait duré de novembre 2008 à juin 2009. \n", "url": "https://fr.m.wikipedia.org/wiki/Fraude_%C3%A0_la_TVA_sur_les_quotas_de_carbone?wprov=sfla1", "hostname": "fr.m.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19218349"}, {"title": "Dualit's Classic Toasters and Kettles", "description": "Buy Dualit's iconic Classic Toaster and Classic Kettle for a matching set of design classics in your kitchen. The Classic Kettle and Toaster are both fully repairable and are available in a range of colours and finishes.", "url": "https://www.dualit.com/products/classic", "hostname": "www.dualit.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221562"}, {"title": "Yes, The U.S. Leads All Countries In Reducing Carbon Emissions", "description": "EPA Administrator Scott Pruitt recently claimed that the U.S. leads the world in reducing carbon dioxide emissions. The Washington Post disagrees, but Pruitt's claim is on firm ground.", "url": "https://www.forbes.com/sites/rrapier/2017/10/24/yes-the-u-s-leads-all-countries-in-reducing-carbon-emissions/", "hostname": "www.forbes.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219473"}, {"title": "The Climate Solutions Caucus", "description": "The Climate Solutions Caucus is a bipartisan group in the US House of Representatives which will explore policy options that address the impacts, causes, and challenges of our changing climate.", "url": "https://citizensclimatelobby.org/climate-solutions-caucus/", "hostname": "citizensclimatelobby.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19217665"}, {"title": "Solutions | Drawdown", "description": "Drawdown maps, measures, models, and describes the 100 most substantive solutions to global warming. For each solution, we describe its history, the carbon impact it provides, the relative cost and savings, the path to adoption, and how it works.", "url": "https://www.drawdown.org/solutions", "hostname": "www.drawdown.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216129"}, {"title": "Environmental impact of aviation - Wikipedia", "description": "\n", "url": "https://en.wikipedia.org/wiki/Environmental_impact_of_aviation", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19217490"}, {"title": "Why is air resistance roughly proportional to the cube of speed? - Quora", "description": "Say you start going five times as fast. Then each second, you will hit five times as many air molecules. You&#039;ll also hit them five times as hard (i.e. transfer five times as much momentum), so the force will be 25 times as much. That makes the for...", "url": "https://www.quora.com/Why-is-air-resistance-roughly-proportional-to-the-cube-of-speed", "hostname": "www.quora.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216611"}, {"title": "Environmental impact of aviation - Wikipedia", "description": "\n", "url": "https://en.wikipedia.org/wiki/Environmental_impact_of_aviation#Mechanisms_and_cumulative_effects_of_aviation_on_climate", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19216892"}, {"title": "Carbon Dioxide From Air Travel | The Green Ration Book", "description": "Domestic  – 316 gm per passenger-kilometer\nShort haul – 260 gm per passenger-kilometer\nLong haul – 210 gm per passenger-kilometer", "url": "http://www.greenrationbook.org.uk/resources/footprints-air-travel/", "hostname": "www.greenrationbook.org.uk", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216443"}, {"title": "Methane from cow burps could be dramatically cut by feeding them seaweed", "description": "California scientists 'very encouraged' by first tests in dairy cattle", "url": "https://www.independent.co.uk/environment/cows-seaweed-methane-burps-cut-greenhouse-gas-emissions-climate-change-research-a8368911.html", "hostname": "www.independent.co.uk", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216586"}, {"title": "Research led by Ermias Kebreab asks if seaweed can cut methane emissions on dairy farms ", "description": "\n\n\n\n\n\n\n\n\nBy Diane Nelson\n\n \n\n\n\n\n\nQuick Summary\n\n\nAdding seaweed to cattle feed may significantly reduce methane emissions from dairy cows\n\tMethod could help dairy farmers meet new state methane-emissions standards\n\tThe UC Davis project is first in the world to test seaweed on live dairy cattle\n\nSeaweed may be the super food dairy cattle need to reduce the amount of methane they burp into the atmosphere. Early results from research at the University of California, Davis, indicate that just a touch of the ocean algae in cattle feed could dramatically cut greenhouse gas emissions from California’s 1.8 million dairy cows.\n\n“This is a very surprising and promising development,” said animal science professor and Sesnon Endowed Chair Ermias Kebreab inside the UC Davis dairy barn where he is testing seaweed efficacy with 12 Holstein cows. “Results are not final, but so far we are seeing substantial emission reductions. This could help California’s dairy farmers meet new methane-emission standards and sustainably produce the dairy products we need to feed the world.”\n\nKebreab’s project is the first to test seaweed on live dairy cattle anywhere in the world.\n\nHis team will publish preliminary findings in late June and begin further tests with additional cattle later this summer.\nProfessor Ermias Kebreab with the UC Davis Department of Animal Science is conducting research with dairy cows to find out if seaweed will reduce methane emissions from cattle. Results are promising, but not final.\n\nA question of digestion\n\nCows and other “ruminant” animals like goats and sheep burp continuously throughout the day as they digest food in their rumen, the first of four sections of their stomachs. The rumen is home to millions of microbes that help ferment and break down high-fiber food like grass and hay. This fermentation produces gases that combine to form methane, an especially potent heat-trapping gas.\n\nSo, as cattle perpetually burp and exhale, they emit methane. Cows also pass methane gas from the other end, but to a much lesser degree. Manure, too, is a source of methane emissions.\n\nIn an effort to reduce greenhouse gas emissions, California legislators recently adopted regulations requiring dairy farmers and other producers to cut methane emissions 40 percent by 2030.\n\n“Since much of a dairy’s methane emissions come from the animal itself, nutrition can play a big role in finding solutions,” said Kebreab.\n\nMolasses, please  \n\nTesting supplements in cattle feed is not new. Kebreab and his colleagues at UC Davis and beyond are finding varying degrees of success with a wide range of feed additives. Some compounds work in the lab with simulated cattle digestive systems, but not with live animals. Researchers in England, for example, found success with curry supplements until they tested it with live cattle.\n\n“The cows didn’t like the curry,” Kebreab said.\n\nDuring lab tests last year, researchers in Australia found that just 2 percent seaweed in cattle feed could reduce methane emissions by 99 percent. The seaweed apparently inhibits an enzyme that contributes to methane production.\n\n \nJudging from the reaction of the UC Davis cows, the seaweed is so far, so good — especially when cut with a bit of molasses.\n\n“The molasses masks the smell,” Kebreab said, smiling as two Holsteins nudged a gate that opens when it’s time for their next meal. “They enjoy their feed.”\n\nTo test seaweed efficacy, Kebreab and animal nutrition graduate student Breanne Roque have separated 12 cows into three groups. Two groups are fed with different doses of seaweed, and one group’s feed has no seaweed at all. They rotate through the two-week feeding regimens with a weeklong seaweed fast in between.   \n\nFour times a day, cows get a snack from an open-air contraption that measures the methane in their breath as they eat the treat.\n An open-air device measures the methane in the cows’ breath as they eat a treat. (Gregory Urquiaga/UC Davis)“The numbers we’re seeing are amazing — well beyond the target that farmers will need to reach,” Kebreab said.\n\nThroughout the seaweed diet, the cows’ milk is tested for qualities like yield, flavor and nutritional content.  \n\nA love of milk \n\nSustainable dairy production is not just an academic endeavor for Kebreab. He has loved milk since he was a young boy growing up in Eritrea, a country in the Horn of Africa.\n\n“I was always amazed at how an animal that eats grass can produce such a high-quality food,” Kebreab said. “And I loved the taste. We didn’t get that much — maybe once or twice a week. I wondered, can we find a way to produce enough milk for everyone?”\n\nKebreab is trying. Among his many projects, Kebreab recently received a $500,000 grant to help improve sustainable livestock production in Ethiopia and Burkina Faso, where dairy cattle produce 5 to 10 liters of milk per day compared to the 45 liters that cows in California can produce. He is working with researchers and funding from the University of Florida with support from the Bill and Melinda Gates Foundation.\n\n“By improving the quality and quantity of dairy production in developing countries, we help families rise from poverty and malnutrition, and also reduce the carbon footprint of cattle worldwide,” Kebreab said.\n\nIf seaweed proves to be a climate-smart supplement, producing it could be environmentally friendly, too. As Kebreab notes, “Growing seaweed doesn’t require land, fresh water or fertilizer.”\nA small amount of macro red algae, a type of seaweed pictured here, is mixed with molasses and cattle feed in a research project by UC Davis Professor Ermias Kebreab. (Gregory Urquiaga/UC Davis)\n\n\n\n\n\n\n\n\n\nMedia Contacts\n\nKat Kerlin, UC Davis News and Media Relations, 530-752-7704, 530-750-9195 (cell), kekerlin@ucdavis.edu\n\tDiane Nelson, UC Davis College of Agricultural and Environmental Sciences, 530-752-1969, denelson@ucdavis.edu\nFaculty Contact\n\nErmias Kebreab, Ph.D., Professor and Sesnon Endowed Chair\n \n\n\n\n\n", "url": "https://animalscience.ucdavis.edu/news/research-led-ermias-kebreab-tests-if-seaweed-cuts-methane-emissions-dairy-farms", "hostname": "animalscience.ucdavis.edu", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219734"}, {"title": "Identification of bioactives from the red seaweed Asparagopsis taxiformis that promote antimethanogenic activity in vitro", "description": "Asparagopsis taxiformishas potent antimethanogenic activity as a feed supplement at 2 % of organic matter in in vitro bioassays. This study identified the main bioactive natural products and their...", "url": "https://link.springer.com/article/10.1007/s10811-016-0830-7", "hostname": "link.springer.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220331"}, {"title": "Team — Symbrosia", "description": null, "url": "https://www.symbrosiasolutions.com/team", "hostname": "www.symbrosiasolutions.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220560"}, {"title": "Cochineal - Wikipedia", "description": "\n", "url": "https://en.m.wikipedia.org/wiki/Cochineal", "hostname": "en.m.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19216505"}, {"title": "Cricket flour - Wikipedia", "description": "Cricket flour is the misnomer term used to refer to powder made from crickets using various processes. [1][2]  Cricket flour differs from true flours made from grains by being composed mainly of protein rather than starches and dietary fiber.\n", "url": "https://en.wikipedia.org/wiki/Cricket_flour", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19221985"}, {"title": "Poultry litter - Wikipedia", "description": "In agriculture, poultry litter or broiler litter is a mixture of poultry excreta, spilled feed, feathers, and material used as bedding in poultry operations.  This term is also used to refer to unused bedding materials. Poultry litter is used in confinement buildings used for raising broilers, turkeys and other birds.  Common bedding materials include wood shavings, sawdust, peanut hulls, shredded sugar cane, straw, and other dry, absorbent, low-cost organic materials. Sand is also occasionally used as bedding. The bedding materials help absorb moisture, limiting the production of ammonia and harmful pathogens. The materials used for bedding can also have a significant impact on carcass quality and bird performance.[1]\n", "url": "https://en.wikipedia.org/wiki/Poultry_litter#Use_as_cattle_feed", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19221017"}, {"title": "Agricultural export value over 90 bn euros in 2018", "description": "Agricultural exports in 2018 were worth an estimated 90.3 billion euros, i.e. 0.2 percent up on 2017. While exports rose, prices dropped relative to 2017.", "url": "https://www.cbs.nl/en-gb/news/2019/03/agricultural-export-value-over-90-bn-euros-in-2018", "hostname": "www.cbs.nl", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19217748"}, {"title": "Heath - Wikipedia", "description": "A heath (/ˈhiːθ/) is a shrubland habitat found mainly on free-draining infertile, acidic soils and is characterised by open, low-growing woody vegetation. Moorland is generally related to high-ground heaths[1] with—especially in Great Britain—a cooler and damper climate.\n", "url": "https://en.wikipedia.org/wiki/Heath", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19216307"}, {"title": "Species reintroduction - Wikipedia", "description": "Species reintroduction is the deliberate release of a species into the wild, from captivity or other areas where the organism is capable of survival.[1] The goal of species reintroduction is to establish a healthy, genetically diverse, self-sustaining population to an area where it has been extirpated, or to augment an existing population.[2] Species that may be eligible for reintroduction are typically threatened or endangered in the wild. However, reintroduction of a species can also be for pest control. For example, wolves being reintroduced to a wild area to curb an overpopulation of elk or deer. Because reintroduction may involve returning native species to localities where they had been extirpated, some prefer the term \"reestablishment\".[1]\n", "url": "https://en.wikipedia.org/wiki/Species_reintroduction#Europe", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19216744"}, {"title": "Pinecoin", "description": "Money Grown on Trees", "url": "https://pinecoin.me", "hostname": "pinecoin.me", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19217262"}, {"title": "‘Perverse’ Carbon Payments Send Flood of Money to China ", "description": "To offset their own carbon emissions, European companies have been overpaying China to incinerate a powerful greenhouse gas known as hfc 23. And in a bizarre twist, those payments have spurred the manufacture of a harmful refrigerant that is being smuggled into the U.S. and used illegally.", "url": "https://e360.yale.edu/features/perverse_co2_payments_send_flood_of_money_to_china", "hostname": "e360.yale.edu", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19218739"}, {"title": "How the world got hooked on palm oil", "description": "The long read: It’s the miracle ingredient in everything from biscuits to shampoo. But our dependence on palm oil has devastating consequences. Is it too late to break the habit?", "url": "https://www.theguardian.com/news/2019/feb/19/palm-oil-ingredient-biscuits-shampoo-environmental", "hostname": "www.theguardian.com", "category": "news", "comment_url": "https://news.ycombinator.com/item?id=19216247"}, {"title": "The beach nobody can touch    - BBC News", "description": "Overrun with tourists, the bay made famous by the film The Beach was shut. Now there are signs of recovery.", "url": "https://www.bbc.co.uk/news/resources/idt-sh/the_beach_nobody_can_touch", "hostname": "www.bbc.co.uk", "category": "news", "comment_url": "https://news.ycombinator.com/item?id=19216247"}, {"title": "The government's revenues - Norwegianpetroleum.no", "description": "Numbers and statistics - sources of revenues includes taxes, fees, the State's direct financial interests (SDFI) and dividends from Equinor ASA. ", "url": "https://www.norskpetroleum.no/en/economy/governments-revenues/", "hostname": "www.norskpetroleum.no", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216725"}, {"title": "New explain | explain.depesz.com", "description": "Copyright © 2008-2015 Hubert \"depesz\" Lubaczewski, Łukasz \"metys\" Lewandowski", "url": "https://explain.depesz.com", "hostname": "explain.depesz.com", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19216315"}, {"title": "Reading PgAdmin Graphical Explain Plans  - Postgres OnLine Journal", "description": "One of our favorite features of PgAdmin is the graphical explain plan feature.  While a graphical explain plan is not a complete\r\nsubstitute for EXPLAIN or EXPLAIN ANALYZE text plans, it does provide a quick and easy to read view that can be used for further analysis.\r\nIn this article, we'll walk thru using\r\nthe explain plan to troubleshoot query performance.\r\n", "url": "http://www.postgresonline.com/journal/archives/27-Reading-PgAdmin-Graphical-Explain-Plans.html", "hostname": "www.postgresonline.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19217746"}, {"title": "PostgreSQL: File Browser", "description": "Copyright © 1996-2019 The PostgreSQL Global Development Group", "url": "https://www.postgresql.org/ftp/pgadmin/pgadmin3/v1.22.2/", "hostname": "www.postgresql.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221095"}, {"title": "Postgres Query Plan Visualization - tatiyants.com", "description": "Postgres Explain Visualizer (Pev) is a tool I wrote to make EXPLAIN output easier to grok. It creates a graphical representation of the query plan.", "url": "http://tatiyants.com/postgres-query-plan-visualization/", "hostname": "tatiyants.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216634"}, {"title": "Instructure jobs", "description": "Job openings at Instructure", "url": "https://jobs.lever.co/instructure?lever-via=NiHimSaI8r&team=Engineering", "hostname": "jobs.lever.co", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19217767"}, {"title": "Explain Plan Cost vs Execution Time", "description": "Before, I have found the \"Cost\" in the execution plan to be a good indicator of relative execution time. Why is this case different? Am I a fool for thinking the execution plan has relevance? What ", "url": "https://stackoverflow.com/questions/102477/explain-plan-cost-vs-execution-time/8177490#8177490", "hostname": "stackoverflow.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216831"}, {"title": "ankane/pghero", "description": "A performance dashboard for Postgres. Contribute to ankane/pghero development by creating an account on GitHub.", "url": "https://github.com/ankane/pghero", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19216561"}, {"title": "heroku/heroku-pg-extras", "description": "A heroku plugin for awesome pg:* commands that are also great and fun and super. - heroku/heroku-pg-extras", "url": "https://github.com/heroku/heroku-pg-extras", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19216899"}, {"title": "Postgres EXPLAIN Visualizer (pev)", "description": null, "url": "http://tatiyants.com/pev/#/plans/plan_1550754076978", "hostname": "tatiyants.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216571"}, {"title": "9JNv | explain.depesz.com", "description": "\n\nSort\n\n\n                        (cost=146.63..148.65\n                        rows=808\n                        width=138)\n\n\n                        (actual\n                        time=55.009..55.012\n                        rows=71\n                        loops=1)\n                    \n", "url": "https://explain.depesz.com/s/9JNv", "hostname": "explain.depesz.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221862"}, {"title": "jRXr | explain.depesz.com", "description": "\n\nSort\n\n\n                        (cost=146.63..148.65\n                        rows=808\n                        width=138)\n\n\n                        (actual\n                        time=55.009..55.012\n                        rows=71\n                        loops=1)\n                    \n", "url": "https://explain.depesz.com/s/jRXr", "hostname": "explain.depesz.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221862"}, {"title": "cxjk | explain.depesz.com", "description": "\n\nSort\n\n\n                        (cost=146.63..148.65\n                        rows=808\n                        width=138)\n\n\n                        (actual\n                        time=55.009..55.012\n                        rows=71\n                        loops=1)\n                    \n", "url": "https://explain.depesz.com/s/cxjk", "hostname": "explain.depesz.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221862"}, {"title": "FPur | explain.depesz.com", "description": "\n\nSort\n\n\n                        (cost=146.63..148.65\n                        rows=808\n                        width=138)\n\n\n                        (actual\n                        time=55.009..55.012\n                        rows=71\n                        loops=1)\n                    \n", "url": "https://explain.depesz.com/s/FPur", "hostname": "explain.depesz.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221862"}, {"title": "GD8 | explain.depesz.com", "description": "\n\nSort\n\n\n                        (cost=146.63..148.65\n                        rows=808\n                        width=138)\n\n\n                        (actual\n                        time=55.009..55.012\n                        rows=71\n                        loops=1)\n                    \n", "url": "https://explain.depesz.com/s/GD8", "hostname": "explain.depesz.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221862"}, {"title": "Flame Graphs for Oracle", "description": "    Topic:  This post is a hands-on introduction to using on-CPU Flame Graphs for investigating Oracle workloads. This technique is about co...", "url": "https://externaltable.blogspot.com/2014/05/flame-graphs-for-oracle.html", "hostname": "externaltable.blogspot.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19218044"}, {"title": "PostgreSQL Performance Monitoring | PostgreSQL Tuning - pganalyze", "description": "DBAs and developers use pganalyze to identify the root cause of performance issues, optimize queries and to get alerts about critical issues. Sign up for free!", "url": "https://pganalyze.com", "hostname": "pganalyze.com", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19220476"}, {"title": "The Query Execution Plan (QEP)", "description": "\n\t© William Yuan 2000\n", "url": "http://ariel.its.unimelb.edu.au/~yuan/Ingres/us_38697.html", "hostname": "ariel.its.unimelb.edu.au", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220068"}, {"title": "Foreign Key to partitioned table – select * from depesz;", "description": "One of the long standing limitations of partitions is that you can't have foreign keys pointing to them.", "url": "https://www.depesz.com/2018/10/02/foreign-key-to-partitioned-table/", "hostname": "www.depesz.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19218386"}, {"title": "Postgres EXPLAIN Visualizer (pev)", "description": null, "url": "http://tatiyants.com/pev/", "hostname": "tatiyants.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221987"}, {"title": "AlexTatiyants/pev", "description": "Postgres Explain Visualizer. Contribute to AlexTatiyants/pev development by creating an account on GitHub.", "url": "https://github.com/AlexTatiyants/pev", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19221987"}, {"title": "vzlS | explain.depesz.com", "description": "\n\nSort\n\n\n                        (cost=146.63..148.65\n                        rows=808\n                        width=138)\n\n\n                        (actual\n                        time=55.009..55.012\n                        rows=71\n                        loops=1)\n                    \n", "url": "https://explain.depesz.com/s/vzlS", "hostname": "explain.depesz.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216504"}, {"title": "DBeaver Community | Free Universal Database Tool", "description": "Free multi-platform database tool for developers, SQL programmers, database administrators and analysts.  Supports all popular databases: MySQL, PostgreSQL, MariaDB, SQLite, Oracle, DB2, SQL Server, Sybase, MS Access, Teradata, Firebird, Derby, etc.", "url": "https://dbeaver.io", "hostname": "dbeaver.io", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19217715"}, {"title": "explain.depesz.com. – select * from depesz;", "description": "Long time ago I wrote small program to filter EXPLAIN ANALYZE output, and add summary of time.", "url": "https://www.depesz.com/2008/12/04/explaindepeszcom/", "hostname": "www.depesz.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216525"}, {"title": "Build and Deploy Serverless Apps with Next.js 8 and Zeit Now", "description": "Configure Next.js 8 serverless mode to generate lambdas for each page. Use Hasura GraphQL API as data layer. Deploy to Zeit Now. Instant setup. Tutorial/boilerplate 👉 nextjs-8-serverless", "url": "https://blog.hasura.io/build-and-deploy-serverless-apps-with-nextjs-8-zeit-now/", "hostname": "blog.hasura.io", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216019"}, {"title": "Serializability vs “Strict” Serializability: The Dirty Secret of Database Isolation Levels", "description": "It was the highest isolation level offered in the vast majority of commercial database systems (some highly widely-deployed systems could not even offer an isolation level as high as serializability). In this post, we show how serializability is not and never was a “gold standard” for database…", "url": "https://fauna.com/blog/serializability-vs-strict-serializability-the-dirty-secret-of-database-isolation-levels", "hostname": "fauna.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219722"}, {"title": "Synchronous replay mode for avoiding stale reads on hot standbys", "description": null, "url": "https://commitfest.postgresql.org/22/1589/", "hostname": "commitfest.postgresql.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220792"}, {"title": "SERIALIZABLE on standby servers", "description": null, "url": "https://commitfest.postgresql.org/22/1799/", "hostname": "commitfest.postgresql.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220792"}, {"title": "postgres/postgres", "description": "Mirror of the official PostgreSQL GIT repository. Note that this is just a *mirror* - we don&#39;t work with pull requests on github. To contribute, please see https://wiki.postgresql.org/wiki/Subm...", "url": "https://github.com/postgres/postgres/tree/master/src/test/isolation/specs", "hostname": "github.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221767"}, {"title": "SERIALIZABLE in PostgreSQL 11... and beyond", "description": "Thanks to the tireless work of Google Summer of Code student Shubham Barai with the support of reviewers, a mentor and a committer, PostgreS...", "url": "https://write-skew.blogspot.com/2018/05/serializable-in-postgresql-11-and-beyond.html", "hostname": "write-skew.blogspot.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221767"}, {"title": "Understanding MySQL Isolation Levels: Repeatable-read | Official Pythian® Blog", "description": "In this informative post, Pep Pla helps readers understand how the default isolation level in MySQL works and show you some surprising facts about it.", "url": "https://blog.pythian.com/understanding-mysql-isolation-levels-repeatable-read/", "hostname": "blog.pythian.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221315"}, {"title": "Kató Lomb - Wikipedia", "description": "Kató Lomb (Pécs, February 8, 1909 – Budapest, June 9, 2003) was a Hungarian interpreter, translator and one of the first simultaneous \ninterpreters in the world.[1] \nOriginally she graduated in physics and chemistry, but her interest soon led her to languages. Native in Hungarian, she was able to interpret fluently in nine or ten languages (in four of them even without preparation), and she translated technical literature and read belles-lettres in six languages. She was able to understand journalism in further eleven languages. As she put it, altogether she earned money with sixteen languages (Bulgarian, Chinese, Danish, English, French, German, Hebrew, Italian, Japanese, Latin, Polish, Romanian, Russian, Slovak, Spanish, Ukrainian). She learned these languages mostly by self-effort, as an autodidact. Her aims to acquire these languages were most of all practical, to satisfy her interest.\n", "url": "https://en.wikipedia.org/wiki/Kat%C3%B3_Lomb", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19215199"}, {"title": "How to Learn a Language: INPUT (Why most methods don't work)", "description": "The first 500 people to click my link will get two months of Skillshare Premium for FREE! http://skl.sh/learned4 ▲Patreon: https://www.patreon.com/WILearned ...", "url": "https://www.youtube.com/watch?v=J_EQDtpYSNM", "hostname": "www.youtube.com", "category": "video", "comment_url": "https://news.ycombinator.com/item?id=19219998"}, {"title": "The Atomic Bomb Considered As Hungarian High School Science Fair Project", "description": "I. A group of Manhattan Project physicists created a tongue-in-cheek mythology where superintelligent Martian scouts landed in Budapest in the late 19th century and stayed for about a generation, a…", "url": "https://slatestarcodex.com/2017/05/26/the-atomic-bomb-considered-as-hungarian-high-school-science-fair-project/", "hostname": "slatestarcodex.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220288"}, {"title": "Macrostrat", "description": "A collaborative platform for geological data exploration and integration", "url": "https://macrostrat.org", "hostname": "macrostrat.org", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19216195"}, {"title": "Trump administration begins effort to strip work permits for immigrant spouses", "description": "Rolling back work permits for the spouses of H-1B visa holders could have sweeping consequences for the Bay Area, where tech companies heavily rely on high-skilled immigrants. Many of those workers come to the U.S. with spouses and children, and the loss of the work permits could jeopardize many families’ ability to stay in the country.", "url": "https://www.sfchronicle.com/business/article/Trump-administration-begins-effort-to-strip-work-13634442.php", "hostname": "www.sfchronicle.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221146"}, {"title": "PERM - Employer Sponsored Green Card | usavisanow.com - Immigration Law Office", "description": "How to obtain a Green Card by Employer Sponsored Labor Certification through PERM: There are 3 steps to obtaining a Green Card through Employer Sponsorship: 1) Labor Certification through the PERM process. 2) I-140 Immigrant Petition for Alien Worker. 3) I-485 Application to Register Permanent Residence. PERM Processing Times: Un-Audited Cases: 2-3 months from filing to certification. Audited Cases: 8 months from filing to certification. PERM Overview: PERM is the process for obtaining labor certification, the first step of the green card process for foreign nationals seeking permanent residence through their employment. To obtain an approved PERM Labor Certification, the employer must prove (through newspaper advertising and other recruiting methods) that they were unsuccessful in recruiting a qualified U.S. worker for a certain position. The employer must be prepared to hire the foreign worker on a full-time and permanent basis. There must be a bona fide job opening available to U.S.", "url": "https://www.usavisanow.com/perm/", "hostname": "www.usavisanow.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19222142"}, {"title": "Explore France's Loire Valley in the Footsteps of Leonardo da Vinci", "description": "Five centuries after his death, visitors can pay homage to the artist at these sites in central France where he spent his final years", "url": "https://www.smithsonianmag.com/travel/explore-frances-loire-valley-in-footsteps-of-leonardo-da-vinci-180971039/", "hostname": "www.smithsonianmag.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220332"}, {"title": "Crazy Circuits: an Open Source Electronics Learning System", "description": "Crazy Circuits: an Open Source Electronics Learning System: The education and home market is flooded with modular electronics 'learning' systems designed to teach kids and adults key STEM and STEAM concepts. Products such a LittleBits or Snapcircuits seem to dominate every holiday gift guide or parent blog...", "url": "https://www.instructables.com/id/Crazy-Circuits-an-Open-Source-Electronics-Learning/", "hostname": "www.instructables.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216101"}, {"title": "BrickLink - Part 4758 : Lego Electric, Plate 2 x 8 with Contacts [Electric] - BrickLink Reference Catalog", "description": "ItemName: Lego Electric, Plate 2 x 8 with Contacts, ItemType: Part, ItemNo: 4758, Buy and sell LEGO parts, Minifigs and sets, both new or used from the world's largest online LEGO marketplace.", "url": "https://www.bricklink.com/v2/catalog/catalogitem.page?P=4758#T=C&C=1", "hostname": "www.bricklink.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221178"}, {"title": "The Three Fives Kit: A Discrete 555 Timer", "description": "Evil Mad Scientist Shop: DIY and open source hardware and software for art, education, and world domination.", "url": "https://shop.evilmadscientist.com/productsmenu/tinykitlist/652", "hostname": "shop.evilmadscientist.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220583"}, {"title": "Project Guides", "description": "Projects and guides for making things with Crazy Circuits.", "url": "https://browndoggadgets.dozuki.com/c/Project_Guides", "hostname": "browndoggadgets.dozuki.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221112"}, {"title": "Crazy Circuits Makerspace Set", "description": "The Makerspace Set has everything you need to get an entire classroom making with Crazy Circuits. Create projects both big and small with over 160 included parts. Use the Touch and Robotics boards to follow one of our programing guides, or create your own code from scratch. Have your students create wearable technology", "url": "https://www.browndoggadgets.com/collections/new-classroom-sets/products/crazy-circuits-makerspace-set", "hostname": "www.browndoggadgets.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19217215"}, {"title": "Featured", "description": "Classroom Projects, DIY Solar Kits, & Solar-Powered Gadgets", "url": "https://www.browndoggadgets.com/collections/featured?sort_by=", "hostname": "www.browndoggadgets.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19218547"}, {"title": "Google Image Result for https://sh-s7-live-s.legocdn.com/is/image/LEGO/630", "description": "Brick Separator - 630 | Classic | LEGO Shop", "url": "https://www.google.com/imgres?imgurl=https://sh-s7-live-s.legocdn.com/is/image/LEGO/630&imgrefurl=https://shop.lego.com/en-US/product/Brick-Separator-630&tbnid=DdRSJTd3GdVwUM&vet=1&docid=w2rsB-nerENr8M&w=400&h=300&source=sh/x/im", "hostname": "www.google.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216856"}, {"title": "Find, customize & generate common SVG icons for your project", "description": "Simple tool to find, customize and generate common SVG icons for your project", "url": "https://iconsvg.xyz", "hostname": "iconsvg.xyz", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19216428"}, {"title": "<color>", "description": "The color CSS data type represents a color in the sRGB color space. A color may also include an alpha-channel transparency value, indicating how the color should composite with its background.", "url": "https://developer.mozilla.org/en-US/docs/Web/CSS/color_value#currentColor_keyword", "hostname": "developer.mozilla.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19217587"}, {"title": "Boxy SVG Editor", "description": "Boxy SVG editor", "url": "https://boxy-svg.com", "hostname": "boxy-svg.com", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19220526"}, {"title": "Icon organizer and icon library | Nucleo", "description": "Nucleo is a beautiful library of 20000+ icons, and a powerful application to collect, customize and export all your icons.", "url": "https://nucleoapp.com", "hostname": "nucleoapp.com", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19217650"}, {"title": "Testing Bash with BATS", "description": "The Bash Automated Testing System puts Bash code through the same types of testing processes used by Java, Ruby, and Python developers.", "url": "https://opensource.com/article/19/2/testing-bash-bats", "hostname": "opensource.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220094"}, {"title": "dbscripts.git - Official repo DB scripts\n", "description": null, "url": "https://git.archlinux.org/dbscripts.git/", "hostname": "git.archlinux.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220934"}, {"title": "Why Create a New Unix Shell?", "description": null, "url": "http://www.oilshell.org/blog/2018/01/28.html", "hostname": "www.oilshell.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221169"}, {"title": "OSH 0.6.pre15 Does Not Crave Chaos and Destruction", "description": null, "url": "http://www.oilshell.org/blog/2019/02/18.html", "hostname": "www.oilshell.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221169"}, {"title": "Access shell script AST. API; CLI · Issue #200 · oilshell/oil", "description": "Hi all, I found the Oil project in the last weeks looking for a static analysis tool of shell scripts. I tried various libraries [1], but none was up to it. I&#39;ve only seen one minor issue with ...", "url": "https://github.com/oilshell/oil/issues/200", "hostname": "github.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221169"}, {"title": "bats-core/bats-core", "description": "Bash Automated Testing System. Contribute to bats-core/bats-core development by creating an account on GitHub.", "url": "https://github.com/bats-core/bats-core/blob/master/libexec/bats-core/bats-preprocess", "hostname": "github.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221525"}, {"title": "Mocking Bash", "description": "pbrisbin dot com", "url": "https://pbrisbin.com/posts/mocking_bash/", "hostname": "pbrisbin.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220924"}, {"title": "Natural Docs", "description": null, "url": "https://www.naturaldocs.org", "hostname": "www.naturaldocs.org", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19220924"}, {"title": "Languages.txt - Natural Docs", "description": "Natural Docs has two files called Languages.txt: one in its Config folder, and one in your project configuration folder.  These control the language features of Natural Docs.", "url": "https://www.naturaldocs.org/reference/languages.txt/#adding_languages", "hostname": "www.naturaldocs.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220924"}, {"title": "ShellCheck – shell script analysis tool", "description": "ShellCheck is an open source static anaylsis tool that automatically finds bugs in your shell scripts.", "url": "https://www.shellcheck.net", "hostname": "www.shellcheck.net", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19220924"}, {"title": "w0rp/ale", "description": "Asynchronous linting/fixing for Vim and Language Server Protocol (LSP) integration - w0rp/ale", "url": "https://github.com/w0rp/ale/tree/master/ale_linters/sh", "hostname": "github.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220924"}, {"title": "docopt—language for description of command-line interfaces", "description": "docopt helps you:", "url": "http://docopt.org", "hostname": "docopt.org", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19220924"}, {"title": "docopt/docopts", "description": "Shell interpreter for docopt, the command-line interface description language. - docopt/docopts", "url": "https://github.com/docopt/docopts", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19220924"}, {"title": "dylanaraps/pure-bash-bible", "description": "📖 A collection of pure bash alternatives to external processes. - dylanaraps/pure-bash-bible", "url": "https://github.com/dylanaraps/pure-bash-bible", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19220924"}, {"title": "Advanced Bash-Scripting Guide", "description": "<thegrendel.abs@gmail.com>", "url": "http://www.tldp.org/LDP/abs/html/", "hostname": "www.tldp.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220924"}, {"title": "Bash Reference Manual", "description": "Bash Reference Manual", "url": "https://www.gnu.org/software/bash/manual/bashref.html", "hostname": "www.gnu.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220924"}, {"title": "BashGuide - Greg's Wiki", "description": "Commands and Arguments ->  \nIntroduction\nYou are invited to make additions or modifications so long as you can keep them accurate.  Please test any code samples you write. All the information here is presented without any warranty or guarantee of accuracy.  Use it at your own risk.  When in doubt, please consult the man pages or the GNU info pages as the authoritative references.   \nAbout This Guide\nA new version of this guide is currently being drafted.  For now, this guide is still the most complete and best reviewed.  Any contributions to the new guide are welcome via GitHub forks. This guide aims to aid people interested in learning to work with BASH.  It aspires to teach good practice techniques for using BASH, and writing simple scripts. This guide is targeted at beginning users.  It assumes no advanced knowledge -- just the ability to login to a Unix-like system and open a command-line (terminal) interface.  It will help if you know how to use a text editor; we will not be covering editors, nor do we endorse any particular editor choice.  Familiarity with the fundamental Unix tool set, or with other programming languages or programming concepts, is not required, but those who have such knowledge may understand some of the examples more quickly. If something is unclear to you, you are invited to report this (use BashGuideFeedback, or the #bash channel on irc.freenode.org) so that it may be clarified in this document for future readers. You are invited to contribute to the development of this document by extending it or correcting invalid or incomplete information. The primary maintainer(s) of this document: -- Lhunath (primary author) -- GreyCat The guide is also available in PDF format. Alternatively, you can just hit print after going to FullBashGuide.  That guarantees you'll be printing the latest version of this document.   \nA Definition\nBASH is an acronym for Bourne Again Shell.  It is based on the Bourne shell and is mostly compatible with its features. Shells are command interpreters.  They are applications that provide users with the ability to give commands to their operating system interactively, or to execute batches of commands quickly.  In no way are they required for the execution of programs; they are merely a layer between system function calls and the user. Think of a shell as a way for you to speak to your system.  Your system doesn't need it for most of its work, but it is an excellent interface between you and what your system can offer.  It allows you to perform basic math, run basic tests and execute applications.  More importantly, it allows you to combine these operations and connect applications to each other to perform complex and automated tasks. BASH is not your operating system.  It is not your window manager.  It is not your terminal (but it oftens runs inside your terminal).  It does not control your mouse or keyboard.  It does not configure your system, activate your screensaver, or open your files when you double-click them.  It is generally not involved in launching applications from your window manager or desktop environment.  It's important to understand that BASH is only an interface for you to execute statements (using BASH syntax), either at the interactive BASH prompt or via BASH scripts.  In The Manual: Introduction  Shell: A (possibly interactive) command interpreter, acting as a layer between the user and the system. \nBash: The Bourne Again Shell, a Bourne compatible shell.   \nUsing Bash\nMost users that think of BASH think of it as a prompt and a command line.  That is BASH in interactive mode.  BASH can also run in non-interactive mode, as when executing scripts.  We can use scripts to automate certain logic.  Scripts are basically lists of commands (just like the ones you can type on the command line), but stored in a file.  When a script is executed, all these commands are (generally) executed sequentially, one after another. We'll start with the basics in an interactive shell. Once you're familiar with those, you can put them together in scripts. Important! \n You should make yourself familiar with the man and apropos commands on the shell.  They will be vital to your self-tutoring. $ man man\n$ man aproposIn this guide, the $ at the beginning of a line represents your BASH prompt.  Traditionally, a shell prompt either ends with $, % or #.  If it ends with $, this indicates a shell that's compatible with the Bourne shell (such as a POSIX shell, or a Korn shell, or Bash).  If it ends with %, this indicates a C shell (csh or tcsh); this guide does not cover C shell.  If it ends with #, this indicates that the shell is running as the system's superuser account (root), and that you should be extra careful. Your actual BASH prompt will probably be much longer than $.  Prompts are often highly individualized. The man command stands for \"manual\"; it opens documentation (so-called \"man pages\") on various topics.  You use it by running the command man [topic] at the BASH prompt, where [topic] is the name of the \"page\" you wish to read.  Note that many of these \"pages\" are considerably longer than one printed page; nevertheless, the name persists.  Each command (application) on your system is likely to have a man page.  There are pages for other things too, such as system calls or specific configuration files.  In this guide, we will only be covering commands. Note that if you're looking for information on BASH built-ins (commands provided by BASH, not by external applications) you should look in man bash instead.  BASH's manual is extensive and detailed.  It is an excellent reference, albeit more technical than this guide. Bash also offers a help command which contains brief summaries of its built-in commands (which we'll discuss in depth later on). $ help\n$ help read In the FAQ: \nIs there a list of which features were added to specific releases (versions) of Bash?  Interactive mode: A mode of operation where a prompt asks you for one command at a time. Script: A file that contains a sequence of commands to execute one after the other.  \nContents\nThe guide has been divided into sections, which are intended to be read roughly in the order presented.  If you skip ahead to a specific section, you might find yourself missing some background information from previous sections.  (Links to relevant sections are not always provided when a topic is mentioned.) Commands and Arguments Types of commands; argument splitting; writing scripts. Special Characters Parameters Variables; special parameters; parameter types; parameter expansion. Patterns Globs; filename matching; extended globs; brace expansion; regular expressions. Tests and Conditionals Exit status; && and ||; if, test and [[; while, until and for; case and select. Arrays Arrays; associative arrays. Input and Output Redirection; here documents; here strings; pipes; process substitution. Compound Commands Subshells; command grouping; arithmetic evaluation; functions; aliases. Sourcing Reading commands from other files. Job Control Practices Choosing your shell; quoting; readability; debugging.  Commands and Arguments ->  CategoryShell ", "url": "http://mywiki.wooledge.org/BashGuide", "hostname": "mywiki.wooledge.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220924"}, {"title": "Plumbum: Shell Combinators and More — Plumbum: Shell Combinators", "description": "Ever wished the compactness of shell scripts be put into a real programming language?\nSay hello to Plumbum Shell Combinators. Plumbum (Latin for lead, which was used to create\npipes back in the day) is a small yet feature-rich library for shell script-like programs in Python.\nThe motto of the library is âNever write shell scripts againâ, and thus it attempts to mimic\nthe shell syntax (shell combinators) where it makes sense, while keeping it all Pythonic\nand cross-platform.", "url": "https://plumbum.readthedocs.io/en/latest/", "hostname": "plumbum.readthedocs.io", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220924"}, {"title": "GENIVI/ramses", "description": "A distributed system for rendering 3D content with focus on bandwidth and resource efficiency - GENIVI/ramses", "url": "https://github.com/GENIVI/ramses", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19216568"}, {"title": "bmw ramses - YouTube", "description": "Enjoy the videos and music you love, upload original content, and share it all with friends, family, and the world on YouTube.", "url": "https://www.youtube.com/results?search_query=bmw+ramses", "hostname": "www.youtube.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19217554"}, {"title": "RAMSES - Domain Interaction Strategy Roll Out - Confluence", "description": "AMM presentation: Genivi_AMM_From_Separated_ECUs_to_a_Display_Cluster.pdf", "url": "https://at.projects.genivi.org/wiki/display/DIRO/RAMSES", "hostname": "at.projects.genivi.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19217554"}, {"title": "Golem Factory", "description": "Golem Factory has 30 repositories available. Follow their code on GitHub.", "url": "https://github.com/golemfactory", "hostname": "github.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220574"}, {"title": "home - Golem", "description": "The Golem Project creates the first global market for idle computer power.", "url": "https://golem.network", "hostname": "golem.network", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19220574"}, {"title": "MOST Bus - Wikipedia", "description": "MOST (Media Oriented Systems Transport) is a high-speed multimedia network technology optimized by the automotive industry. It can be used for applications inside or outside the car. The serial MOST bus uses a daisy-chain topology or ring topology and synchronous data communication to transport audio, video, voice and data signals via plastic optical fiber (POF) (MOST25, MOST150) or electrical conductor (MOST50, MOST150) physical layers.\n", "url": "https://en.m.wikipedia.org/wiki/MOST_Bus", "hostname": "en.m.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19220157"}, {"title": "vvvv - a multipurpose toolkit", "description": "\n\n\nvvvv is a hybrid visual/textual live-programming environment for easy prototyping and development. It is designed to facilitate the handling of large media environments with physical interfaces, re", "url": "https://vvvv.org", "hostname": "vvvv.org", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19218181"}, {"title": "Propaganda", "description": "\n\n\nDepending on where you come from you can approach vvvv in different ways. The following provides an overview of vvvvs main capabilities and features conveniently grouped by buzzwords.\n\n\nvvvv is you", "url": "https://vvvv.org/propaganda", "hostname": "vvvv.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19218181"}, {"title": "Gtk3 vs HTML5 – Alexander Larsson", "description": "The last few weeks I’ve been working on an interesting new idea, hacking out a prototype.", "url": "https://blogs.gnome.org/alexl/2010/11/23/gtk3-vs-html5/", "hostname": "blogs.gnome.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221185"}, {"title": "th0ma5w/live-jython-processing", "description": "a minimalistic setup for message queue driven live coding with processing libs and jython - th0ma5w/live-jython-processing", "url": "https://github.com/th0ma5w/live-jython-processing", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19219708"}, {"title": "General Motors ", "description": "GitHub is where General Motors  builds software.", "url": "https://github.com/GeneralMotors", "hostname": "github.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19217369"}, {"title": "cruise-automation/webviz", "description": "web-based visualization libraries. Contribute to cruise-automation/webviz development by creating an account on GitHub.", "url": "https://github.com/cruise-automation/webviz", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19217713"}, {"title": "Deep Learning from Scratch to GPU - 5 - Sharing Memory", "description": "Sharing and reusing memory buffers is inescapable if we want high performance. It is a sharp but powerful tool.", "url": "https://dragan.rocks/articles/19/Deep-Learning-in-Clojure-From-Scratch-to-GPU-5-Sharing-Memory", "hostname": "dragan.rocks", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19218053"}, {"title": "Clojure & GPU Software", "description": "Dragan Djuric's Clojure Blog, Artificial Intelligence, Deep Learning, Bayesian Data Analysis, CUDA, GPU, OpenCL, Functional Programming, Probabilistic Programming, Data Science.", "url": "https://dragan.rocks/software/", "hostname": "dragan.rocks", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220655"}, {"title": "apache/incubator-mxnet", "description": "Lightweight, Portable, Flexible Distributed/Mobile Deep Learning with Dynamic, Mutation-aware Dataflow Dep Scheduler; for Python, R, Julia, Scala, Go, Javascript and more - apache/incubator-mxnet", "url": "https://github.com/apache/incubator-mxnet/tree/master/contrib/clojure-package", "hostname": "github.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220975"}, {"title": "The Clojure Toolbox", "description": "A categorised directory of libraries and tools for Clojure", "url": "https://www.clojure-toolbox.com", "hostname": "www.clojure-toolbox.com", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19220396"}, {"title": "weavejester/clojure-toolbox.com", "description": "Source to clojure-toolbox.com. Contribute to weavejester/clojure-toolbox.com development by creating an account on GitHub.", "url": "https://github.com/weavejester/clojure-toolbox.com", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19220396"}, {"title": "Intelligent Tracking Prevention 2.1", "description": null, "url": "https://webkit.org/blog/8613/intelligent-tracking-prevention-2-1/", "hostname": "webkit.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219478"}, {"title": "  Shazam for iOS Sheds 3rd Party SDKs", "description": null, "url": "https://blog.appfigures.com/shazam-for-ios-sheds-3rd-party-sdks/", "hostname": "blog.appfigures.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220520"}, {"title": "Google Groups", "description": "Google Groups allows you to create and participate in online forums and email-based groups with a rich experience for community conversations.", "url": "https://groups.google.com/forum/?utm_medium=email&utm_source=footer#!msg/django-developers/RyDdt1TcH0c/-43fqP5OAQAJ", "hostname": "groups.google.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220530"}, {"title": "Redirecting...", "description": null, "url": "http://app.hive.co/l/feb-21-jobs-hn", "hostname": "app.hive.co", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221126"}, {"title": "Massive Progress, Exact CPU Selected & Minor Shipping Adjustment – Purism", "description": "  We are so close to being finished, and we are so excited about it. Things are progressing so rapidly at Purism, in and around the Librem 5 smartphone, that we want to share the latest updates with you. As we’ve said before, we want to make a secure mobile communication device; one which offers …", "url": "https://puri.sm/posts/massive-progress-exact-cpu-selected-minor-shipping-adjustment/", "hostname": "puri.sm", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19218178"}, {"title": "FOSDEM 2019 Blog! Pinebook Pro, PinePhone Dev Kits and much more!", "description": null, "url": "https://forum.pine64.org/showthread.php?tid=7093&pid=43850#pid43850", "hostname": "forum.pine64.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220558"}, {"title": "postmarketOS (Akademy)", "description": "\nAdam Van Ymeren,\nAdrian Siekierka,\nAerotinge,\najakk,\nAlexandroid99,\nAlex Dills,\nAlex Roth,\nAlfie Day,\nalive4ever,\nAnton Lazarev,\nashirviskas,\nAshymad,\nAttila SzÃ¶llÅsi,\nBart Ribbers,\nBen Iofel,\nBhushan Shah,\nbhuvi,\nBK,\nBradley Gamble,\nBrian Otto,\nCallum A. D. Thomson,\ncarlos killpack,\ncclauss,\nChinmaya Krishnan Mahesh,\nClaudio Maggioni,\nClayton Craft,\ncmdr2,\nCraig Tatlor,\ncybermonkey,\nDaniele Debernardi,\nDaniil Yarancev,\nDavide Gessa,\ndeata,\nDecatf,\nDimitris Zervas,\nDuncan Guthrie,\nEmil Lauridsen,\nEric Hosmer,\nEthan R. Jones,\nFabrice DesrÃ©,\nFilip MatijeviÄ,\nfjmax,\ngeorge99g,\nGeorge Hopkins,\nGrant Miller,\nindefini,\nj0ki,\nJacob Juric,\nJames Heald,\nJBB,\nJean Lucas,\nJochen Sprickerhof,\nJoey Hewitt,\nJonty Sewell,\njoris,\njoshas,\nkamnxt,\nKenneth Endfinger,\nKevin Liu,\nKlaus,\nKonrad Dybcio,\nkskarthik,\nLarvitar,\nlawl,\nLionel Duboeuf,\nLucas Ramage,\nLuca Weiss,\nMagnus Gulin,\nMarcin Mielniczuk,\nMartijn Braam,\nMarti Raudsepp,\nMathieu Maret,\nMayeul Cantan,\nMichael Hamann,\nMichael Orishich,\nmontvid,\nmyfreeweb,\nNick Boone,\nNikk Saan,\nNikolay,\nNotKit,\nNutcake,\nOlgierd Nowakowski,\nOliver Smith,\nPablo Castellano,\nPavel Machek,\nPeter Mann,\nPierre Rudloff,\npikpok,\nPiotr Halama,\npraticamentetilde,\nracer123,\nRares,\nRicardo Rodrigues,\nrrooij,\nryang,\nRyan Murthick,\nSaiKarthik Karra,\nSamuel Dionne-Riel,\nSantosh D,\nshwsh,\nSicelo,\nSimon Schmeisser,\nsteamport,\nTomas Safarik,\nVadim Rutkovsky,\nWilliam O-D,\nWouter Franken,\nXinayder,\nYan,\nyangxuan8282,\nYuval Adam,\nzhenyolka,\nzhuowei\n", "url": "https://postmarketos.org/static/slides/2018-akademy/#18", "hostname": "postmarketos.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220185"}, {"title": "Replicant", "description": null, "url": "https://replicant.us", "hostname": "replicant.us", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19220185"}, {"title": "\npostmarketOS // real Linux distribution for phones\n", "description": "Aiming for a 10 year life-cycle for smartphones", "url": "https://postmarketos.org", "hostname": "postmarketos.org", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19220185"}, {"title": "Librem 5 24-inch Monitor kit – Purism", "description": "$1,399.00", "url": "https://shop.puri.sm/shop/librem-5-24-inch-kit/", "hostname": "shop.puri.sm", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219196"}, {"title": "What are the phone specs? – Purism", "description": "Development is still ongoing, so most of the specs are not finalized yet. What is certain at this moment is:", "url": "https://puri.sm/faq/what-are-the-phone-specs/", "hostname": "puri.sm", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220219"}, {"title": "Librem 5 – Purism", "description": "The only modern smartphone you can (truly) own. To many in the world, modern smartphones have become the single most significant piece of technology in their lives, a gateway to the world and representing your digital life. This comes at a price however: the tech industry have progressively turned you into the product or entrapped …", "url": "https://puri.sm/products/librem-5/", "hostname": "puri.sm", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220167"}, {"title": "Homepage - Jolla", "description": null, "url": "https://jolla.com", "hostname": "jolla.com", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19220179"}, {"title": "Gemini Devices", "description": "An ultra-thin mobile enabled smartphone with integrated tactile keyboard for typing and creating on the go. ", "url": "https://store.planetcom.co.uk/collections/gemini-pda", "hostname": "store.planetcom.co.uk", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220179"}, {"title": "A Fairly Fast Fibonacci Function - OranLooney.com", "description": "A common example of recursion is the function to calculate the \\(n\\)-th Fibonacci number:\ndef naive_fib(n):\rif n < 2:\rreturn n\relse:\rreturn naive_fib(n-1) + naive_fib(n-2)\rThis follows the mathematical definition very closely but itâs performance is terrible: roughly \\(\\mathcal{O}(2^n)\\). This is commonly patched up with dynamic programming. Specifically, either the memoization:\nfrom functools import lru_cache\r@lru_cache(100)\rdef memoized_fib(n):\rif n < 2:\rreturn n\relse:\rreturn memoized_fib(n-1) + memoized_fib(n-2)\ror tabulation:", "url": "http://www.oranlooney.com/post/fibonacci/", "hostname": "www.oranlooney.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19216356"}, {"title": "Fibonacci implementations in Ruby", "description": "Fibonacci implementations in Ruby. GitHub Gist: instantly share code, notes, and snippets.", "url": "https://gist.github.com/jfarmer/99ecb2903bd881c7e72bd47003f56ef2", "hostname": "gist.github.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219223"}, {"title": "Zome Arithmetic", "description": "An Observable notebook by Jacob Rus.", "url": "https://beta.observablehq.com/@jrus/zome-arithmetic", "hostname": "beta.observablehq.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19219303"}, {"title": "robinhouston/fibonacci-float-calc", "description": "Calculating Fibonacci numbers using floating-point arithmetic - robinhouston/fibonacci-float-calc", "url": "https://github.com/robinhouston/fibonacci-float-calc", "hostname": "github.com", "category": "repository", "comment_url": "https://news.ycombinator.com/item?id=19220707"}, {"title": "Addition chain - Wikipedia", "description": "In mathematics, an addition chain for computing a positive integer n can be given by a sequence of natural numbers v and a sequence of index pairs w such that each term in v is the sum of two previous terms, the indices of those terms being specified by w:\n", "url": "https://en.wikipedia.org/wiki/Addition_chain", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19221699"}, {"title": "Fast Fibonacci algorithms", "description": "Definition: The Fibonacci sequence is defined as \\(F(0) = 0\\), \\(F(1) = 1\\), and \\(F(n) = F(n-1) + F(n-2)\\) for \\(n ≥ 2\\). So the sequence (starting with \\(F(0)\\)) is 0, 1, 1, 2, 3, 5, 8, 13, 21, ….", "url": "https://www.nayuki.io/page/fast-fibonacci-algorithms", "hostname": "www.nayuki.io", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19218438"}, {"title": "Rounding - Wikipedia", "description": "Rounding a number means replacing it with a different number that is approximately equal to the original, but has a shorter, simpler, or more explicit representation; for example, replacing $23.4476 with $23.45, or the fraction 312/937 with 1/3, or the expression √2 with 1.414.\n", "url": "https://en.wikipedia.org/wiki/Rounding#Table-maker's_dilemma", "hostname": "en.wikipedia.org", "category": "wiki_article", "comment_url": "https://news.ycombinator.com/item?id=19219743"}, {"title": "  A Formula for the n-th Fibonacci number    ", "description": "How to find formulae for Fibonacci  numbers. How can we compute\n  Fib(100) without computing all the earlier Fibonacci numbers?  How many\n  digits does Fib(100) have?  Using the LOG button on your calculator\n  to answer this.  Binet's formula is introduced and explained and methods of computing\n  big Fibonacci numbers accurately and quickly with several online calculators to help with your investigations.", "url": "http://www.maths.surrey.ac.uk/hosted-sites/R.Knott/Fibonacci/fibFormula.html", "hostname": "www.maths.surrey.ac.uk", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19218994"}, {"title": "The Lab Discovering DNA in Old Books", "description": "Even the beeswax used in seals is rich with data about the past, including the flowers that grew in that region year to year", "url": "https://www.theatlantic.com/science/archive/2019/02/dna-books-artifacts/582814/", "hostname": "www.theatlantic.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19203595"}, {"title": "Mrs. Stoner Speaks: An Interview with Nancy Gardner Williams", "description": "Nancy Gardner Williams, who was married to the cult-favorite novelist John Williams, discusses his newly reissued debut, ‘Nothing but the Night.’", "url": "https://www.theparisreview.org/blog/2019/02/20/mrs-stoner-speaks-an-interview-with-nancy-gardner-williams/", "hostname": "www.theparisreview.org", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220128"}, {"title": "Teaching people to trade stocks is like starting them on heroin — Munger | The Evidence-Based Investor", "description": "Warren Buffett's business partner Charlie Munger has warned that teaching people to trade stocks is like starting them on heroin.", "url": "https://www.evidenceinvestor.com/teaching-people-to-trade-stocks-is-like-starting-them-on-heroin-munger/", "hostname": "www.evidenceinvestor.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19220658"}, {"title": "Robinhood Careers", "description": "Our mission is to democratize America’s financial system. Join our team.", "url": "https://careers.robinhood.com", "hostname": "careers.robinhood.com", "category": "site", "comment_url": "https://news.ycombinator.com/item?id=19222019"}, {"title": "Imgur", "description": null, "url": "https://imgur.com/EQ0iWWT", "hostname": "imgur.com", "category": "uncategorized", "comment_url": "https://news.ycombinator.com/item?id=19221583"}, {"title": "Ben Hunt on Twitter", "description": "““Next time the market drops 30% to 40% and stays there, they’ll have plenty of deals to do,” said [insert name of random BRK owner here].\n\nThis is why Buffett can't just return cash in a dividend. It crushes the only narrative still supporting the stock. https://t.co/rZNBWm8peP”", "url": "https://twitter.com/EpsilonTheory/status/1098596558495453187", "hostname": "twitter.com", "category": "tweet", "comment_url": "https://news.ycombinator.com/item?id=19221040"}, {"title": "Ben Hunt on Twitter", "description": "“Alpha = private information. Period. Full stop. https://t.co/ObBGQPvRMH”", "url": "https://twitter.com/EpsilonTheory/status/1096360266416209920", "hostname": "twitter.com", "category": "tweet", "comment_url": "https://news.ycombinator.com/item?id=19221040"}], "categories": ["site", "repository", "wiki_article", "amazon_item", "video", "tweet", "subreddit", "reddit_post", "news", "uncategorized"]}